# Comparing `tmp/cxapit-1.0.1.tar.gz` & `tmp/cxapit-1.0.2.tar.gz`

## filetype from file(1)

```diff
@@ -1 +1 @@
-gzip compressed data, was "dist/cxapit-1.0.1.tar", last modified: Mon Apr  8 03:35:19 2024, max compression
+gzip compressed data, was "dist/cxapit-1.0.2.tar", last modified: Mon Apr  8 07:22:34 2024, max compression
```

## Comparing `cxapit-1.0.1.tar` & `cxapit-1.0.2.tar`

### file list

```diff
@@ -1,16 +1,16 @@
-drwxr-xr-x   0 root         (0) root         (0)        0 2024-04-08 03:35:19.000000 cxapit-1.0.1/
--rw-r--r--   0 root         (0) root         (0)      271 2024-04-08 03:35:19.000000 cxapit-1.0.1/PKG-INFO
-drwxr-xr-x   0 root         (0) root         (0)        0 2024-04-08 03:35:18.000000 cxapit-1.0.1/cxapit.egg-info/
--rw-r--r--   0 root         (0) root         (0)      271 2024-04-08 03:35:18.000000 cxapit-1.0.1/cxapit.egg-info/PKG-INFO
--rw-r--r--   0 root         (0) root         (0)      230 2024-04-08 03:35:18.000000 cxapit-1.0.1/cxapit.egg-info/SOURCES.txt
--rw-r--r--   0 root         (0) root         (0)       17 2024-04-08 03:35:18.000000 cxapit-1.0.1/cxapit.egg-info/requires.txt
--rw-r--r--   0 root         (0) root         (0)        7 2024-04-08 03:35:18.000000 cxapit-1.0.1/cxapit.egg-info/top_level.txt
--rw-r--r--   0 root         (0) root         (0)        1 2024-04-08 03:35:18.000000 cxapit-1.0.1/cxapit.egg-info/dependency_links.txt

-    <c>   DW_AT_producer    : (strp) (offset: 0x3183): GNU C 4.8.5 20150623 (Red Hat 4.8.5-44) -m64 -mtune=generic -march=x86-64 -g -O2 -fexceptions -fstack-protector-strong -fwrapv -fPIC --param ssp-buffer-size=4
+    <c>   DW_AT_producer    : (strp) (offset: 0x3220): GNU C 4.8.5 20150623 (Red Hat 4.8.5-44) -m64 -mtune=generic -march=x86-64 -g -O2 -fexceptions -fstack-protector-strong -fwrapv -fPIC --param ssp-buffer-size=4
     <10>   DW_AT_language    : (data1) 1	(ANSI C)
-    <11>   DW_AT_name        : (strp) (offset: 0x2803): ./cxapit/Tools.c
-    <15>   DW_AT_comp_dir    : (strp) (offset: 0xea9): /data/cxapit
-    <19>   DW_AT_ranges      : (sec_offset) 0x3620
+    <11>   DW_AT_name        : (strp) (offset: 0x28a0): ./cxapit/Tools.c
+    <15>   DW_AT_comp_dir    : (strp) (offset: 0xef9): /data/cxapit
+    <19>   DW_AT_ranges      : (sec_offset) 0x4140
     <1d>   DW_AT_low_pc      : (addr) 0
     <25>   DW_AT_stmt_list   : (sec_offset) 0
  <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2a>   DW_AT_name        : (strp) (offset: 0x1618): size_t
+    <2a>   DW_AT_name        : (strp) (offset: 0x167f): size_t
     <2e>   DW_AT_decl_file   : (data1) 2
     <2f>   DW_AT_decl_line   : (data1) 212
     <30>   DW_AT_type        : (ref4) <0x34>, long unsigned int
  <1><34>: Abbrev Number: 3 (DW_TAG_base_type)
     <35>   DW_AT_byte_size   : (data1) 8
     <36>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <37>   DW_AT_name        : (strp) (offset: 0x2b51): long unsigned int
+    <37>   DW_AT_name        : (strp) (offset: 0x2bee): long unsigned int
  <1><3b>: Abbrev Number: 3 (DW_TAG_base_type)
     <3c>   DW_AT_byte_size   : (data1) 1
     <3d>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <3e>   DW_AT_name        : (strp) (offset: 0xc8f): unsigned char
+    <3e>   DW_AT_name        : (strp) (offset: 0xcdf): unsigned char
  <1><42>: Abbrev Number: 3 (DW_TAG_base_type)
     <43>   DW_AT_byte_size   : (data1) 2
     <44>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <45>   DW_AT_name        : (strp) (offset: 0x1b26): short unsigned int
+    <45>   DW_AT_name        : (strp) (offset: 0x1b8d): short unsigned int
  <1><49>: Abbrev Number: 3 (DW_TAG_base_type)
     <4a>   DW_AT_byte_size   : (data1) 4
     <4b>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <4c>   DW_AT_name        : (strp) (offset: 0x2b56): unsigned int
+    <4c>   DW_AT_name        : (strp) (offset: 0x2bf3): unsigned int
  <1><50>: Abbrev Number: 3 (DW_TAG_base_type)
     <51>   DW_AT_byte_size   : (data1) 1
     <52>   DW_AT_encoding    : (data1) 6	(signed char)
-    <53>   DW_AT_name        : (strp) (offset: 0xc91): signed char
+    <53>   DW_AT_name        : (strp) (offset: 0xce1): signed char
  <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
     <58>   DW_AT_byte_size   : (data1) 2
     <59>   DW_AT_encoding    : (data1) 5	(signed)
-    <5a>   DW_AT_name        : (strp) (offset: 0x3356): short int
+    <5a>   DW_AT_name        : (strp) (offset: 0x33f3): short int
  <1><5e>: Abbrev Number: 4 (DW_TAG_base_type)
     <5f>   DW_AT_byte_size   : (data1) 4
     <60>   DW_AT_encoding    : (data1) 5	(signed)
     <61>   DW_AT_name        : (string) int
  <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
     <66>   DW_AT_byte_size   : (data1) 8
     <67>   DW_AT_encoding    : (data1) 5	(signed)
-    <68>   DW_AT_name        : (strp) (offset: 0x2f23): long int
+    <68>   DW_AT_name        : (strp) (offset: 0x2fc0): long int
  <1><6c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6d>   DW_AT_name        : (strp) (offset: 0x44b): __off_t
+    <6d>   DW_AT_name        : (strp) (offset: 0x45c): __off_t
     <71>   DW_AT_decl_file   : (data1) 3
     <72>   DW_AT_decl_line   : (data1) 140
     <73>   DW_AT_type        : (ref4) <0x65>, long int
  <1><77>: Abbrev Number: 2 (DW_TAG_typedef)
-    <78>   DW_AT_name        : (strp) (offset: 0x1c8b): __off64_t
+    <78>   DW_AT_name        : (strp) (offset: 0x1cf2): __off64_t
     <7c>   DW_AT_decl_file   : (data1) 3
     <7d>   DW_AT_decl_line   : (data1) 141
     <7e>   DW_AT_type        : (ref4) <0x65>, long int
  <1><82>: Abbrev Number: 3 (DW_TAG_base_type)
     <83>   DW_AT_byte_size   : (data1) 8
     <84>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <85>   DW_AT_name        : (strp) (offset: 0x1ac9): sizetype
+    <85>   DW_AT_name        : (strp) (offset: 0x1b30): sizetype
  <1><89>: Abbrev Number: 5 (DW_TAG_pointer_type)
     <8a>   DW_AT_byte_size   : (data1) 8
  <1><8b>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8c>   DW_AT_name        : (strp) (offset: 0x1615): __ssize_t
+    <8c>   DW_AT_name        : (strp) (offset: 0x167c): __ssize_t
     <90>   DW_AT_decl_file   : (data1) 3
     <91>   DW_AT_decl_line   : (data1) 181
     <92>   DW_AT_type        : (ref4) <0x65>, long int
  <1><96>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <97>   DW_AT_byte_size   : (data1) 8
     <98>   DW_AT_type        : (ref4) <0x9c>, char
  <1><9c>: Abbrev Number: 3 (DW_TAG_base_type)
     <9d>   DW_AT_byte_size   : (data1) 1
     <9e>   DW_AT_encoding    : (data1) 6	(signed char)
-    <9f>   DW_AT_name        : (strp) (offset: 0xc98): char
+    <9f>   DW_AT_name        : (strp) (offset: 0xce8): char
  <1><a3>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a4>   DW_AT_name        : (strp) (offset: 0x2476): FILE
+    <a4>   DW_AT_name        : (strp) (offset: 0x2501): FILE
     <a8>   DW_AT_decl_file   : (data1) 4
     <a9>   DW_AT_decl_line   : (data1) 48
     <aa>   DW_AT_type        : (ref4) <0xae>, _IO_FILE
  <1><ae>: Abbrev Number: 7 (DW_TAG_structure_type)
-    <af>   DW_AT_name        : (strp) (offset: 0x2472): _IO_FILE
+    <af>   DW_AT_name        : (strp) (offset: 0x24fd): _IO_FILE
     <b3>   DW_AT_byte_size   : (data1) 216
     <b4>   DW_AT_decl_file   : (data1) 5
     <b5>   DW_AT_decl_line   : (data1) 246
     <b6>   DW_AT_sibling     : (ref4) <0x22f>
  <2><ba>: Abbrev Number: 8 (DW_TAG_member)
-    <bb>   DW_AT_name        : (strp) (offset: 0x1817): _flags
+    <bb>   DW_AT_name        : (strp) (offset: 0x187e): _flags
     <bf>   DW_AT_decl_file   : (data1) 5
     <c0>   DW_AT_decl_line   : (data1) 247
     <c1>   DW_AT_type        : (ref4) <0x5e>, int
     <c5>   DW_AT_data_member_location: (data1) 0
  <2><c6>: Abbrev Number: 8 (DW_TAG_member)
-    <c7>   DW_AT_name        : (strp) (offset: 0x2caf): _IO_read_ptr
+    <c7>   DW_AT_name        : (strp) (offset: 0x2d4c): _IO_read_ptr
     <cb>   DW_AT_decl_file   : (data1) 5
     <cc>   DW_AT_decl_line   : (data1) 252
     <cd>   DW_AT_type        : (ref4) <0x96>, char
     <d1>   DW_AT_data_member_location: (data1) 8
  <2><d2>: Abbrev Number: 8 (DW_TAG_member)
-    <d3>   DW_AT_name        : (strp) (offset: 0x2431): _IO_read_end
+    <d3>   DW_AT_name        : (strp) (offset: 0x24bc): _IO_read_end
     <d7>   DW_AT_decl_file   : (data1) 5
     <d8>   DW_AT_decl_line   : (data1) 253
     <d9>   DW_AT_type        : (ref4) <0x96>, char
     <dd>   DW_AT_data_member_location: (data1) 16
  <2><de>: Abbrev Number: 8 (DW_TAG_member)
-    <df>   DW_AT_name        : (strp) (offset: 0x1cae): _IO_read_base
+    <df>   DW_AT_name        : (strp) (offset: 0x1d15): _IO_read_base
     <e3>   DW_AT_decl_file   : (data1) 5
     <e4>   DW_AT_decl_line   : (data1) 254
     <e5>   DW_AT_type        : (ref4) <0x96>, char
     <e9>   DW_AT_data_member_location: (data1) 24
  <2><ea>: Abbrev Number: 8 (DW_TAG_member)
-    <eb>   DW_AT_name        : (strp) (offset: 0x1e31): _IO_write_base
+    <eb>   DW_AT_name        : (strp) (offset: 0x1e98): _IO_write_base
     <ef>   DW_AT_decl_file   : (data1) 5
     <f0>   DW_AT_decl_line   : (data1) 255
     <f1>   DW_AT_type        : (ref4) <0x96>, char
     <f5>   DW_AT_data_member_location: (data1) 32
  <2><f6>: Abbrev Number: 9 (DW_TAG_member)
-    <f7>   DW_AT_name        : (strp) (offset: 0xfd8): _IO_write_ptr
+    <f7>   DW_AT_name        : (strp) (offset: 0x1028): _IO_write_ptr
     <fb>   DW_AT_decl_file   : (data1) 5
     <fc>   DW_AT_decl_line   : (data2) 256
     <fe>   DW_AT_type        : (ref4) <0x96>, char
     <102>   DW_AT_data_member_location: (data1) 40
  <2><103>: Abbrev Number: 9 (DW_TAG_member)
-    <104>   DW_AT_name        : (strp) (offset: 0x743): _IO_write_end
+    <104>   DW_AT_name        : (strp) (offset: 0x754): _IO_write_end
     <108>   DW_AT_decl_file   : (data1) 5
     <109>   DW_AT_decl_line   : (data2) 257
     <10b>   DW_AT_type        : (ref4) <0x96>, char
     <10f>   DW_AT_data_member_location: (data1) 48
  <2><110>: Abbrev Number: 9 (DW_TAG_member)
-    <111>   DW_AT_name        : (strp) (offset: 0x2361): _IO_buf_base
+    <111>   DW_AT_name        : (strp) (offset: 0x23ec): _IO_buf_base
     <115>   DW_AT_decl_file   : (data1) 5
     <116>   DW_AT_decl_line   : (data2) 258
     <118>   DW_AT_type        : (ref4) <0x96>, char
     <11c>   DW_AT_data_member_location: (data1) 56
  <2><11d>: Abbrev Number: 9 (DW_TAG_member)
-    <11e>   DW_AT_name        : (strp) (offset: 0x1d31): _IO_buf_end
+    <11e>   DW_AT_name        : (strp) (offset: 0x1d98): _IO_buf_end
     <122>   DW_AT_decl_file   : (data1) 5
     <123>   DW_AT_decl_line   : (data2) 259
     <125>   DW_AT_type        : (ref4) <0x96>, char
     <129>   DW_AT_data_member_location: (data1) 64
  <2><12a>: Abbrev Number: 9 (DW_TAG_member)
-    <12b>   DW_AT_name        : (strp) (offset: 0x12bf): _IO_save_base
+    <12b>   DW_AT_name        : (strp) (offset: 0x130f): _IO_save_base
     <12f>   DW_AT_decl_file   : (data1) 5
     <130>   DW_AT_decl_line   : (data2) 261
     <132>   DW_AT_type        : (ref4) <0x96>, char
     <136>   DW_AT_data_member_location: (data1) 72
  <2><137>: Abbrev Number: 9 (DW_TAG_member)
-    <138>   DW_AT_name        : (strp) (offset: 0x2c9f): _IO_backup_base
+    <138>   DW_AT_name        : (strp) (offset: 0x2d3c): _IO_backup_base
     <13c>   DW_AT_decl_file   : (data1) 5
     <13d>   DW_AT_decl_line   : (data2) 262
     <13f>   DW_AT_type        : (ref4) <0x96>, char
     <143>   DW_AT_data_member_location: (data1) 80
  <2><144>: Abbrev Number: 9 (DW_TAG_member)
-    <145>   DW_AT_name        : (strp) (offset: 0x1974): _IO_save_end
+    <145>   DW_AT_name        : (strp) (offset: 0x19db): _IO_save_end
     <149>   DW_AT_decl_file   : (data1) 5
     <14a>   DW_AT_decl_line   : (data2) 263
     <14c>   DW_AT_type        : (ref4) <0x96>, char
     <150>   DW_AT_data_member_location: (data1) 88
  <2><151>: Abbrev Number: 9 (DW_TAG_member)
-    <152>   DW_AT_name        : (strp) (offset: 0x26e0): _markers
+    <152>   DW_AT_name        : (strp) (offset: 0x277d): _markers
     <156>   DW_AT_decl_file   : (data1) 5
     <157>   DW_AT_decl_line   : (data2) 265
     <159>   DW_AT_type        : (ref4) <0x277>, _IO_marker
     <15d>   DW_AT_data_member_location: (data1) 96
  <2><15e>: Abbrev Number: 9 (DW_TAG_member)
-    <15f>   DW_AT_name        : (strp) (offset: 0xbbc): _chain
+    <15f>   DW_AT_name        : (strp) (offset: 0xbf7): _chain
     <163>   DW_AT_decl_file   : (data1) 5
     <164>   DW_AT_decl_line   : (data2) 267
     <166>   DW_AT_type        : (ref4) <0x27d>, _IO_FILE
     <16a>   DW_AT_data_member_location: (data1) 104
  <2><16b>: Abbrev Number: 9 (DW_TAG_member)
     <16c>   DW_AT_name        : (strp) (offset: 0x88): _fileno
     <170>   DW_AT_decl_file   : (data1) 5
     <171>   DW_AT_decl_line   : (data2) 269
     <173>   DW_AT_type        : (ref4) <0x5e>, int
     <177>   DW_AT_data_member_location: (data1) 112
  <2><178>: Abbrev Number: 9 (DW_TAG_member)
-    <179>   DW_AT_name        : (strp) (offset: 0x2f41): _flags2
+    <179>   DW_AT_name        : (strp) (offset: 0x2fde): _flags2
     <17d>   DW_AT_decl_file   : (data1) 5
     <17e>   DW_AT_decl_line   : (data2) 273
     <180>   DW_AT_type        : (ref4) <0x5e>, int
     <184>   DW_AT_data_member_location: (data1) 116
  <2><185>: Abbrev Number: 9 (DW_TAG_member)
-    <186>   DW_AT_name        : (strp) (offset: 0x2e96): _old_offset
+    <186>   DW_AT_name        : (strp) (offset: 0x2f33): _old_offset
     <18a>   DW_AT_decl_file   : (data1) 5
     <18b>   DW_AT_decl_line   : (data2) 275
     <18d>   DW_AT_type        : (ref4) <0x6c>, __off_t, long int
     <191>   DW_AT_data_member_location: (data1) 120
  <2><192>: Abbrev Number: 9 (DW_TAG_member)
-    <193>   DW_AT_name        : (strp) (offset: 0x2b80): _cur_column
+    <193>   DW_AT_name        : (strp) (offset: 0x2c1d): _cur_column
     <197>   DW_AT_decl_file   : (data1) 5
     <198>   DW_AT_decl_line   : (data2) 279
     <19a>   DW_AT_type        : (ref4) <0x42>, short unsigned int
     <19e>   DW_AT_data_member_location: (data1) 128
  <2><19f>: Abbrev Number: 9 (DW_TAG_member)
-    <1a0>   DW_AT_name        : (strp) (offset: 0x336a): _vtable_offset
+    <1a0>   DW_AT_name        : (strp) (offset: 0x3407): _vtable_offset
     <1a4>   DW_AT_decl_file   : (data1) 5
     <1a5>   DW_AT_decl_line   : (data2) 280
     <1a7>   DW_AT_type        : (ref4) <0x50>, signed char
     <1ab>   DW_AT_data_member_location: (data1) 130
  <2><1ac>: Abbrev Number: 9 (DW_TAG_member)
-    <1ad>   DW_AT_name        : (strp) (offset: 0x2f5): _shortbuf
+    <1ad>   DW_AT_name        : (strp) (offset: 0x306): _shortbuf
     <1b1>   DW_AT_decl_file   : (data1) 5
     <1b2>   DW_AT_decl_line   : (data2) 281
     <1b4>   DW_AT_type        : (ref4) <0x283>, char
     <1b8>   DW_AT_data_member_location: (data1) 131
  <2><1b9>: Abbrev Number: 9 (DW_TAG_member)
-    <1ba>   DW_AT_name        : (strp) (offset: 0x48f): _lock
+    <1ba>   DW_AT_name        : (strp) (offset: 0x4a0): _lock
     <1be>   DW_AT_decl_file   : (data1) 5
     <1bf>   DW_AT_decl_line   : (data2) 285
     <1c1>   DW_AT_type        : (ref4) <0x293>, _IO_lock_t
     <1c5>   DW_AT_data_member_location: (data1) 136
  <2><1c6>: Abbrev Number: 9 (DW_TAG_member)
-    <1c7>   DW_AT_name        : (strp) (offset: 0x2e9a): _offset
+    <1c7>   DW_AT_name        : (strp) (offset: 0x2f37): _offset
     <1cb>   DW_AT_decl_file   : (data1) 5
     <1cc>   DW_AT_decl_line   : (data2) 294
     <1ce>   DW_AT_type        : (ref4) <0x77>, __off64_t, long int
     <1d2>   DW_AT_data_member_location: (data1) 144
  <2><1d3>: Abbrev Number: 9 (DW_TAG_member)
-    <1d4>   DW_AT_name        : (strp) (offset: 0x260b): __pad1
+    <1d4>   DW_AT_name        : (strp) (offset: 0x2696): __pad1
     <1d8>   DW_AT_decl_file   : (data1) 5
     <1d9>   DW_AT_decl_line   : (data2) 303
     <1db>   DW_AT_type        : (ref4) <0x89>
     <1df>   DW_AT_data_member_location: (data1) 152
  <2><1e0>: Abbrev Number: 9 (DW_TAG_member)
-    <1e1>   DW_AT_name        : (strp) (offset: 0x13e5): __pad2
+    <1e1>   DW_AT_name        : (strp) (offset: 0x1435): __pad2
     <1e5>   DW_AT_decl_file   : (data1) 5
     <1e6>   DW_AT_decl_line   : (data2) 304
     <1e8>   DW_AT_type        : (ref4) <0x89>
     <1ec>   DW_AT_data_member_location: (data1) 160
  <2><1ed>: Abbrev Number: 9 (DW_TAG_member)
-    <1ee>   DW_AT_name        : (strp) (offset: 0x2612): __pad3
+    <1ee>   DW_AT_name        : (strp) (offset: 0x269d): __pad3
     <1f2>   DW_AT_decl_file   : (data1) 5
     <1f3>   DW_AT_decl_line   : (data2) 305
     <1f5>   DW_AT_type        : (ref4) <0x89>
     <1f9>   DW_AT_data_member_location: (data1) 168
  <2><1fa>: Abbrev Number: 9 (DW_TAG_member)
-    <1fb>   DW_AT_name        : (strp) (offset: 0x2619): __pad4
+    <1fb>   DW_AT_name        : (strp) (offset: 0x26a4): __pad4
     <1ff>   DW_AT_decl_file   : (data1) 5
     <200>   DW_AT_decl_line   : (data2) 306
     <202>   DW_AT_type        : (ref4) <0x89>
     <206>   DW_AT_data_member_location: (data1) 176
  <2><207>: Abbrev Number: 9 (DW_TAG_member)
-    <208>   DW_AT_name        : (strp) (offset: 0x2620): __pad5
+    <208>   DW_AT_name        : (strp) (offset: 0x26ab): __pad5
     <20c>   DW_AT_decl_file   : (data1) 5
     <20d>   DW_AT_decl_line   : (data2) 307
     <20f>   DW_AT_type        : (ref4) <0x29>, size_t, long unsigned int
     <213>   DW_AT_data_member_location: (data1) 184
  <2><214>: Abbrev Number: 9 (DW_TAG_member)
-    <215>   DW_AT_name        : (strp) (offset: 0x1e20): _mode
+    <215>   DW_AT_name        : (strp) (offset: 0x1e87): _mode
     <219>   DW_AT_decl_file   : (data1) 5
     <21a>   DW_AT_decl_line   : (data2) 309
     <21c>   DW_AT_type        : (ref4) <0x5e>, int
     <220>   DW_AT_data_member_location: (data1) 192
  <2><221>: Abbrev Number: 9 (DW_TAG_member)
     <222>   DW_AT_name        : (strp) (offset: 0x7f): _unused2
     <226>   DW_AT_decl_file   : (data1) 5
@@ -268,37 +268,37 @@
     <230>   DW_AT_type        : (ref4) <0x9c>, char
     <234>   DW_AT_sibling     : (ref4) <0x23f>
  <2><238>: Abbrev Number: 11 (DW_TAG_subrange_type)
     <239>   DW_AT_type        : (ref4) <0x82>, sizetype
     <23d>   DW_AT_upper_bound : (data1) 3
  <2><23e>: Abbrev Number: 0
  <1><23f>: Abbrev Number: 12 (DW_TAG_typedef)
-    <240>   DW_AT_name        : (strp) (offset: 0xd04): _IO_lock_t
+    <240>   DW_AT_name        : (strp) (offset: 0xd54): _IO_lock_t
     <244>   DW_AT_decl_file   : (data1) 5
     <245>   DW_AT_decl_line   : (data1) 155
  <1><246>: Abbrev Number: 7 (DW_TAG_structure_type)
-    <247>   DW_AT_name        : (strp) (offset: 0x1f1c): _IO_marker
+    <247>   DW_AT_name        : (strp) (offset: 0x1f96): _IO_marker
     <24b>   DW_AT_byte_size   : (data1) 24
     <24c>   DW_AT_decl_file   : (data1) 5
     <24d>   DW_AT_decl_line   : (data1) 161
     <24e>   DW_AT_sibling     : (ref4) <0x277>
  <2><252>: Abbrev Number: 8 (DW_TAG_member)
-    <253>   DW_AT_name        : (strp) (offset: 0x14e0): _next
+    <253>   DW_AT_name        : (strp) (offset: 0x1547): _next
     <257>   DW_AT_decl_file   : (data1) 5
     <258>   DW_AT_decl_line   : (data1) 162
     <259>   DW_AT_type        : (ref4) <0x277>, _IO_marker
     <25d>   DW_AT_data_member_location: (data1) 0
  <2><25e>: Abbrev Number: 8 (DW_TAG_member)
-    <25f>   DW_AT_name        : (strp) (offset: 0x194c): _sbuf
+    <25f>   DW_AT_name        : (strp) (offset: 0x19b3): _sbuf
     <263>   DW_AT_decl_file   : (data1) 5
     <264>   DW_AT_decl_line   : (data1) 163
     <265>   DW_AT_type        : (ref4) <0x27d>, _IO_FILE
     <269>   DW_AT_data_member_location: (data1) 8
  <2><26a>: Abbrev Number: 8 (DW_TAG_member)
-    <26b>   DW_AT_name        : (strp) (offset: 0x26e9): _pos
+    <26b>   DW_AT_name        : (strp) (offset: 0x2786): _pos
     <26f>   DW_AT_decl_file   : (data1) 5
     <270>   DW_AT_decl_line   : (data1) 167
     <271>   DW_AT_type        : (ref4) <0x5e>, int
     <275>   DW_AT_data_member_location: (data1) 16
  <2><276>: Abbrev Number: 0
  <1><277>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <278>   DW_AT_byte_size   : (data1) 8
@@ -325,31 +325,31 @@
  <2><2a8>: Abbrev Number: 0
  <1><2a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <2aa>   DW_AT_byte_size   : (data1) 8
     <2ab>   DW_AT_type        : (ref4) <0x2af>, char
  <1><2af>: Abbrev Number: 13 (DW_TAG_const_type)
     <2b0>   DW_AT_type        : (ref4) <0x9c>, char
  <1><2b4>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2b5>   DW_AT_name        : (strp) (offset: 0x1617): ssize_t
+    <2b5>   DW_AT_name        : (strp) (offset: 0x167e): ssize_t
     <2b9>   DW_AT_decl_file   : (data1) 4
     <2ba>   DW_AT_decl_line   : (data1) 102
     <2bb>   DW_AT_type        : (ref4) <0x8b>, __ssize_t, long int
  <1><2bf>: Abbrev Number: 14 (DW_TAG_typedef)
-    <2c0>   DW_AT_name        : (strp) (offset: 0x1c95): wchar_t
+    <2c0>   DW_AT_name        : (strp) (offset: 0x1cfc): wchar_t
     <2c4>   DW_AT_decl_file   : (data1) 2
     <2c5>   DW_AT_decl_line   : (data2) 324
     <2c7>   DW_AT_type        : (ref4) <0x5e>, int
  <1><2cb>: Abbrev Number: 3 (DW_TAG_base_type)
     <2cc>   DW_AT_byte_size   : (data1) 8
     <2cd>   DW_AT_encoding    : (data1) 5	(signed)
-    <2ce>   DW_AT_name        : (strp) (offset: 0x2f1e): long long int
+    <2ce>   DW_AT_name        : (strp) (offset: 0x2fbb): long long int
  <1><2d2>: Abbrev Number: 3 (DW_TAG_base_type)
     <2d3>   DW_AT_byte_size   : (data1) 8
     <2d4>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <2d5>   DW_AT_name        : (strp) (offset: 0x2b4c): long long unsigned int
+    <2d5>   DW_AT_name        : (strp) (offset: 0x2be9): long long unsigned int
  <1><2d9>: Abbrev Number: 10 (DW_TAG_array_type)
     <2da>   DW_AT_type        : (ref4) <0x9c>, char
     <2de>   DW_AT_sibling     : (ref4) <0x2e9>
  <2><2e2>: Abbrev Number: 11 (DW_TAG_subrange_type)
     <2e3>   DW_AT_type        : (ref4) <0x82>, sizetype
     <2e7>   DW_AT_upper_bound : (data1) 7
  <2><2e8>: Abbrev Number: 0
@@ -364,406 +364,406 @@
     <2fa>   DW_AT_type        : (ref4) <0x9c>, char
     <2fe>   DW_AT_sibling     : (ref4) <0x309>
  <2><302>: Abbrev Number: 11 (DW_TAG_subrange_type)
     <303>   DW_AT_type        : (ref4) <0x82>, sizetype
     <307>   DW_AT_upper_bound : (data1) 1
  <2><308>: Abbrev Number: 0
  <1><309>: Abbrev Number: 2 (DW_TAG_typedef)
-    <30a>   DW_AT_name        : (strp) (offset: 0x203c): uint32_t
+    <30a>   DW_AT_name        : (strp) (offset: 0x20b6): uint32_t
     <30e>   DW_AT_decl_file   : (data1) 6
     <30f>   DW_AT_decl_line   : (data1) 51
     <310>   DW_AT_type        : (ref4) <0x49>, unsigned int
  <1><314>: Abbrev Number: 2 (DW_TAG_typedef)
-    <315>   DW_AT_name        : (strp) (offset: 0xea0): uint64_t
+    <315>   DW_AT_name        : (strp) (offset: 0xef0): uint64_t
     <319>   DW_AT_decl_file   : (data1) 6
     <31a>   DW_AT_decl_line   : (data1) 55
     <31b>   DW_AT_type        : (ref4) <0x34>, long unsigned int
  <1><31f>: Abbrev Number: 2 (DW_TAG_typedef)
-    <320>   DW_AT_name        : (strp) (offset: 0x2e80): Py_ssize_t
+    <320>   DW_AT_name        : (strp) (offset: 0x2f1d): Py_ssize_t
     <324>   DW_AT_decl_file   : (data1) 7
     <325>   DW_AT_decl_line   : (data1) 84
     <326>   DW_AT_type        : (ref4) <0x2b4>, ssize_t, __ssize_t, long int
  <1><32a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <32b>   DW_AT_name        : (strp) (offset: 0x14bb): Py_hash_t
+    <32b>   DW_AT_name        : (strp) (offset: 0x1522): Py_hash_t
     <32f>   DW_AT_decl_file   : (data1) 7
     <330>   DW_AT_decl_line   : (data1) 93
     <331>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><335>: Abbrev Number: 3 (DW_TAG_base_type)
     <336>   DW_AT_byte_size   : (data1) 4
     <337>   DW_AT_encoding    : (data1) 4	(float)
-    <338>   DW_AT_name        : (strp) (offset: 0x1fc6): float
+    <338>   DW_AT_name        : (strp) (offset: 0x2040): float
  <1><33c>: Abbrev Number: 3 (DW_TAG_base_type)
     <33d>   DW_AT_byte_size   : (data1) 8
     <33e>   DW_AT_encoding    : (data1) 4	(float)
-    <33f>   DW_AT_name        : (strp) (offset: 0x27b9): double
+    <33f>   DW_AT_name        : (strp) (offset: 0x2856): double
  <1><343>: Abbrev Number: 7 (DW_TAG_structure_type)
-    <344>   DW_AT_name        : (strp) (offset: 0x5e8): _object
+    <344>   DW_AT_name        : (strp) (offset: 0x5f9): _object
     <348>   DW_AT_byte_size   : (data1) 16
     <349>   DW_AT_decl_file   : (data1) 8
     <34a>   DW_AT_decl_line   : (data1) 106
     <34b>   DW_AT_sibling     : (ref4) <0x368>
  <2><34f>: Abbrev Number: 8 (DW_TAG_member)
     <350>   DW_AT_name        : (strp) (offset: 0x1ce): ob_refcnt
     <354>   DW_AT_decl_file   : (data1) 8
     <355>   DW_AT_decl_line   : (data1) 108
     <356>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <35a>   DW_AT_data_member_location: (data1) 0
  <2><35b>: Abbrev Number: 8 (DW_TAG_member)
-    <35c>   DW_AT_name        : (strp) (offset: 0x895): ob_type
+    <35c>   DW_AT_name        : (strp) (offset: 0x8c0): ob_type
     <360>   DW_AT_decl_file   : (data1) 8
     <361>   DW_AT_decl_line   : (data1) 109
     <362>   DW_AT_type        : (ref4) <0x5f9>, _typeobject
     <366>   DW_AT_data_member_location: (data1) 8
  <2><367>: Abbrev Number: 0
  <1><368>: Abbrev Number: 15 (DW_TAG_structure_type)
-    <369>   DW_AT_name        : (strp) (offset: 0x53c): _typeobject
+    <369>   DW_AT_name        : (strp) (offset: 0x54d): _typeobject
     <36d>   DW_AT_byte_size   : (data2) 400
     <36f>   DW_AT_decl_file   : (data1) 8
     <370>   DW_AT_decl_line   : (data2) 346
     <372>   DW_AT_sibling     : (ref4) <0x5f9>
  <2><376>: Abbrev Number: 9 (DW_TAG_member)
-    <377>   DW_AT_name        : (strp) (offset: 0xaab): ob_base
+    <377>   DW_AT_name        : (strp) (offset: 0xae6): ob_base
     <37b>   DW_AT_decl_file   : (data1) 8
     <37c>   DW_AT_decl_line   : (data2) 347
     <37e>   DW_AT_type        : (ref4) <0x62b>, PyVarObject
     <382>   DW_AT_data_member_location: (data1) 0
  <2><383>: Abbrev Number: 9 (DW_TAG_member)
-    <384>   DW_AT_name        : (strp) (offset: 0x19f6): tp_name
+    <384>   DW_AT_name        : (strp) (offset: 0x1a5d): tp_name
     <388>   DW_AT_decl_file   : (data1) 8
     <389>   DW_AT_decl_line   : (data2) 348
     <38b>   DW_AT_type        : (ref4) <0x2a9>, char
     <38f>   DW_AT_data_member_location: (data1) 24
  <2><390>: Abbrev Number: 9 (DW_TAG_member)
-    <391>   DW_AT_name        : (strp) (offset: 0x33a3): tp_basicsize
+    <391>   DW_AT_name        : (strp) (offset: 0x3440): tp_basicsize
     <395>   DW_AT_decl_file   : (data1) 8
     <396>   DW_AT_decl_line   : (data2) 349
     <398>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <39c>   DW_AT_data_member_location: (data1) 32
  <2><39d>: Abbrev Number: 9 (DW_TAG_member)
-    <39e>   DW_AT_name        : (strp) (offset: 0x3d7): tp_itemsize
+    <39e>   DW_AT_name        : (strp) (offset: 0x3e8): tp_itemsize
     <3a2>   DW_AT_decl_file   : (data1) 8
     <3a3>   DW_AT_decl_line   : (data2) 349
     <3a5>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <3a9>   DW_AT_data_member_location: (data1) 40
  <2><3aa>: Abbrev Number: 9 (DW_TAG_member)
-    <3ab>   DW_AT_name        : (strp) (offset: 0x4bf): tp_dealloc
+    <3ab>   DW_AT_name        : (strp) (offset: 0x4d0): tp_dealloc
     <3af>   DW_AT_decl_file   : (data1) 8
     <3b0>   DW_AT_decl_line   : (data2) 353
     <3b2>   DW_AT_type        : (ref4) <0xc0d>, destructor
     <3b6>   DW_AT_data_member_location: (data1) 48
  <2><3b7>: Abbrev Number: 9 (DW_TAG_member)
-    <3b8>   DW_AT_name        : (strp) (offset: 0x2b43): tp_print
+    <3b8>   DW_AT_name        : (strp) (offset: 0x2be0): tp_print
     <3bc>   DW_AT_decl_file   : (data1) 8
     <3bd>   DW_AT_decl_line   : (data2) 354
     <3bf>   DW_AT_type        : (ref4) <0xc2a>, printfunc, int
     <3c3>   DW_AT_data_member_location: (data1) 56
  <2><3c4>: Abbrev Number: 9 (DW_TAG_member)
     <3c5>   DW_AT_name        : (strp) (offset: 0x155): tp_getattr
     <3c9>   DW_AT_decl_file   : (data1) 8
     <3ca>   DW_AT_decl_line   : (data2) 355
     <3cc>   DW_AT_type        : (ref4) <0xc5b>, getattrfunc, PyObject, _object
     <3d0>   DW_AT_data_member_location: (data1) 64
  <2><3d1>: Abbrev Number: 9 (DW_TAG_member)
-    <3d2>   DW_AT_name        : (strp) (offset: 0xbff): tp_setattr
+    <3d2>   DW_AT_name        : (strp) (offset: 0xc3a): tp_setattr
     <3d6>   DW_AT_decl_file   : (data1) 8
     <3d7>   DW_AT_decl_line   : (data2) 356
     <3d9>   DW_AT_type        : (ref4) <0xc8d>, setattrfunc, int
     <3dd>   DW_AT_data_member_location: (data1) 72
  <2><3de>: Abbrev Number: 9 (DW_TAG_member)
-    <3df>   DW_AT_name        : (strp) (offset: 0x257): tp_as_async
+    <3df>   DW_AT_name        : (strp) (offset: 0x268): tp_as_async
     <3e3>   DW_AT_decl_file   : (data1) 8
     <3e4>   DW_AT_decl_line   : (data2) 357
     <3e6>   DW_AT_type        : (ref4) <0xda9>, PyAsyncMethods
     <3ea>   DW_AT_data_member_location: (data1) 80
  <2><3eb>: Abbrev Number: 9 (DW_TAG_member)
-    <3ec>   DW_AT_name        : (strp) (offset: 0x2e04): tp_repr
+    <3ec>   DW_AT_name        : (strp) (offset: 0x2ea1): tp_repr
     <3f0>   DW_AT_decl_file   : (data1) 8
     <3f1>   DW_AT_decl_line   : (data2) 359
     <3f3>   DW_AT_type        : (ref4) <0xcc4>, reprfunc, PyObject, _object
     <3f7>   DW_AT_data_member_location: (data1) 88
  <2><3f8>: Abbrev Number: 9 (DW_TAG_member)
-    <3f9>   DW_AT_name        : (strp) (offset: 0x2127): tp_as_number
+    <3f9>   DW_AT_name        : (strp) (offset: 0x21a1): tp_as_number
     <3fd>   DW_AT_decl_file   : (data1) 8
     <3fe>   DW_AT_decl_line   : (data2) 363
     <400>   DW_AT_type        : (ref4) <0xdaf>, PyNumberMethods
     <404>   DW_AT_data_member_location: (data1) 96
  <2><405>: Abbrev Number: 9 (DW_TAG_member)
-    <406>   DW_AT_name        : (strp) (offset: 0x1a85): tp_as_sequence
+    <406>   DW_AT_name        : (strp) (offset: 0x1aec): tp_as_sequence
     <40a>   DW_AT_decl_file   : (data1) 8
     <40b>   DW_AT_decl_line   : (data2) 364
     <40d>   DW_AT_type        : (ref4) <0xdb5>, PySequenceMethods
     <411>   DW_AT_data_member_location: (data1) 104
  <2><412>: Abbrev Number: 9 (DW_TAG_member)
-    <413>   DW_AT_name        : (strp) (offset: 0xfe6): tp_as_mapping
+    <413>   DW_AT_name        : (strp) (offset: 0x1036): tp_as_mapping
     <417>   DW_AT_decl_file   : (data1) 8
     <418>   DW_AT_decl_line   : (data2) 365
     <41a>   DW_AT_type        : (ref4) <0xdbb>, PyMappingMethods
     <41e>   DW_AT_data_member_location: (data1) 112
  <2><41f>: Abbrev Number: 9 (DW_TAG_member)
-    <420>   DW_AT_name        : (strp) (offset: 0x2547): tp_hash
+    <420>   DW_AT_name        : (strp) (offset: 0x25d2): tp_hash
     <424>   DW_AT_decl_file   : (data1) 8
     <425>   DW_AT_decl_line   : (data2) 369
     <427>   DW_AT_type        : (ref4) <0xcd0>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <42b>   DW_AT_data_member_location: (data1) 120
  <2><42c>: Abbrev Number: 9 (DW_TAG_member)
-    <42d>   DW_AT_name        : (strp) (offset: 0x99d): tp_call
+    <42d>   DW_AT_name        : (strp) (offset: 0x9c8): tp_call
     <431>   DW_AT_decl_file   : (data1) 8
     <432>   DW_AT_decl_line   : (data2) 370
     <434>   DW_AT_type        : (ref4) <0x681>, ternaryfunc, PyObject, _object
     <438>   DW_AT_data_member_location: (data1) 128
  <2><439>: Abbrev Number: 9 (DW_TAG_member)
-    <43a>   DW_AT_name        : (strp) (offset: 0xa14): tp_str
+    <43a>   DW_AT_name        : (strp) (offset: 0xa4f): tp_str
     <43e>   DW_AT_decl_file   : (data1) 8
     <43f>   DW_AT_decl_line   : (data2) 371
     <441>   DW_AT_type        : (ref4) <0xcc4>, reprfunc, PyObject, _object
     <445>   DW_AT_data_member_location: (data1) 136
  <2><446>: Abbrev Number: 9 (DW_TAG_member)
-    <447>   DW_AT_name        : (strp) (offset: 0x1d76): tp_getattro
+    <447>   DW_AT_name        : (strp) (offset: 0x1ddd): tp_getattro
     <44b>   DW_AT_decl_file   : (data1) 8
     <44c>   DW_AT_decl_line   : (data2) 372
     <44e>   DW_AT_type        : (ref4) <0xc81>, getattrofunc, PyObject, _object
     <452>   DW_AT_data_member_location: (data1) 144
  <2><453>: Abbrev Number: 9 (DW_TAG_member)
-    <454>   DW_AT_name        : (strp) (offset: 0x28ad): tp_setattro
+    <454>   DW_AT_name        : (strp) (offset: 0x294a): tp_setattro
     <458>   DW_AT_decl_file   : (data1) 8
     <459>   DW_AT_decl_line   : (data2) 373
     <45b>   DW_AT_type        : (ref4) <0xcb8>, setattrofunc, int
     <45f>   DW_AT_data_member_location: (data1) 152
  <2><460>: Abbrev Number: 9 (DW_TAG_member)
-    <461>   DW_AT_name        : (strp) (offset: 0x1aac): tp_as_buffer
+    <461>   DW_AT_name        : (strp) (offset: 0x1b13): tp_as_buffer
     <465>   DW_AT_decl_file   : (data1) 8
     <466>   DW_AT_decl_line   : (data2) 376
     <468>   DW_AT_type        : (ref4) <0xdc1>, PyBufferProcs
     <46c>   DW_AT_data_member_location: (data1) 160
  <2><46d>: Abbrev Number: 9 (DW_TAG_member)
-    <46e>   DW_AT_name        : (strp) (offset: 0x302f): tp_flags
+    <46e>   DW_AT_name        : (strp) (offset: 0x30cc): tp_flags
     <472>   DW_AT_decl_file   : (data1) 8
     <473>   DW_AT_decl_line   : (data2) 379
     <475>   DW_AT_type        : (ref4) <0x34>, long unsigned int
     <479>   DW_AT_data_member_location: (data1) 168
  <2><47a>: Abbrev Number: 9 (DW_TAG_member)
-    <47b>   DW_AT_name        : (strp) (offset: 0x2228): tp_doc
+    <47b>   DW_AT_name        : (strp) (offset: 0x22a2): tp_doc
     <47f>   DW_AT_decl_file   : (data1) 8
     <480>   DW_AT_decl_line   : (data2) 381
     <482>   DW_AT_type        : (ref4) <0x2a9>, char
     <486>   DW_AT_data_member_location: (data1) 176
  <2><487>: Abbrev Number: 9 (DW_TAG_member)
-    <488>   DW_AT_name        : (strp) (offset: 0x276e): tp_traverse
+    <488>   DW_AT_name        : (strp) (offset: 0x280b): tp_traverse
     <48c>   DW_AT_decl_file   : (data1) 8
     <48d>   DW_AT_decl_line   : (data2) 385
     <48f>   DW_AT_type        : (ref4) <0x8a1>, traverseproc, int
     <493>   DW_AT_data_member_location: (data1) 184
  <2><494>: Abbrev Number: 9 (DW_TAG_member)
-    <495>   DW_AT_name        : (strp) (offset: 0xe66): tp_clear
+    <495>   DW_AT_name        : (strp) (offset: 0xeb6): tp_clear
     <499>   DW_AT_decl_file   : (data1) 8
     <49a>   DW_AT_decl_line   : (data2) 388
     <49c>   DW_AT_type        : (ref4) <0x6ab>, inquiry, int
     <4a0>   DW_AT_data_member_location: (data1) 192
  <2><4a1>: Abbrev Number: 9 (DW_TAG_member)
-    <4a2>   DW_AT_name        : (strp) (offset: 0x69d): tp_richcompare
+    <4a2>   DW_AT_name        : (strp) (offset: 0x6ae): tp_richcompare
     <4a6>   DW_AT_decl_file   : (data1) 8
     <4a7>   DW_AT_decl_line   : (data2) 392
     <4a9>   DW_AT_type        : (ref4) <0xcf1>, richcmpfunc, PyObject, _object
     <4ad>   DW_AT_data_member_location: (data1) 200
  <2><4ae>: Abbrev Number: 9 (DW_TAG_member)
-    <4af>   DW_AT_name        : (strp) (offset: 0x218b): tp_weaklistoffset
+    <4af>   DW_AT_name        : (strp) (offset: 0x2205): tp_weaklistoffset
     <4b3>   DW_AT_decl_file   : (data1) 8
     <4b4>   DW_AT_decl_line   : (data2) 395
     <4b6>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <4ba>   DW_AT_data_member_location: (data1) 208
  <2><4bb>: Abbrev Number: 9 (DW_TAG_member)
-    <4bc>   DW_AT_name        : (strp) (offset: 0x29c5): tp_iter
+    <4bc>   DW_AT_name        : (strp) (offset: 0x2a62): tp_iter
     <4c0>   DW_AT_decl_file   : (data1) 8
     <4c1>   DW_AT_decl_line   : (data2) 398
     <4c3>   DW_AT_type        : (ref4) <0xd1c>, getiterfunc, PyObject, _object
     <4c7>   DW_AT_data_member_location: (data1) 216
  <2><4c8>: Abbrev Number: 9 (DW_TAG_member)
-    <4c9>   DW_AT_name        : (strp) (offset: 0x2960): tp_iternext
+    <4c9>   DW_AT_name        : (strp) (offset: 0x29fd): tp_iternext
     <4cd>   DW_AT_decl_file   : (data1) 8
     <4ce>   DW_AT_decl_line   : (data2) 399
     <4d0>   DW_AT_type        : (ref4) <0xd28>, iternextfunc, PyObject, _object
     <4d4>   DW_AT_data_member_location: (data1) 224
  <2><4d5>: Abbrev Number: 9 (DW_TAG_member)
-    <4d6>   DW_AT_name        : (strp) (offset: 0x1e26): tp_methods
+    <4d6>   DW_AT_name        : (strp) (offset: 0x1e8d): tp_methods
     <4da>   DW_AT_decl_file   : (data1) 8
     <4db>   DW_AT_decl_line   : (data2) 402
     <4dd>   DW_AT_type        : (ref4) <0xe04>, PyMethodDef
     <4e1>   DW_AT_data_member_location: (data1) 232
  <2><4e2>: Abbrev Number: 9 (DW_TAG_member)
-    <4e3>   DW_AT_name        : (strp) (offset: 0x274d): tp_members
+    <4e3>   DW_AT_name        : (strp) (offset: 0x27ea): tp_members
     <4e7>   DW_AT_decl_file   : (data1) 8
     <4e8>   DW_AT_decl_line   : (data2) 403
     <4ea>   DW_AT_type        : (ref4) <0xe53>, PyMemberDef
     <4ee>   DW_AT_data_member_location: (data1) 240
  <2><4ef>: Abbrev Number: 9 (DW_TAG_member)
-    <4f0>   DW_AT_name        : (strp) (offset: 0x2941): tp_getset
+    <4f0>   DW_AT_name        : (strp) (offset: 0x29de): tp_getset
     <4f4>   DW_AT_decl_file   : (data1) 8
     <4f5>   DW_AT_decl_line   : (data2) 404
     <4f7>   DW_AT_type        : (ref4) <0xea2>, PyGetSetDef
     <4fb>   DW_AT_data_member_location: (data1) 248
  <2><4fc>: Abbrev Number: 16 (DW_TAG_member)
-    <4fd>   DW_AT_name        : (strp) (offset: 0x2a9a): tp_base
+    <4fd>   DW_AT_name        : (strp) (offset: 0x2b37): tp_base
     <501>   DW_AT_decl_file   : (data1) 8
     <502>   DW_AT_decl_line   : (data2) 405
     <504>   DW_AT_type        : (ref4) <0x5f9>, _typeobject
     <508>   DW_AT_data_member_location: (data2) 256
  <2><50a>: Abbrev Number: 16 (DW_TAG_member)
-    <50b>   DW_AT_name        : (strp) (offset: 0xfb4): tp_dict
+    <50b>   DW_AT_name        : (strp) (offset: 0x1004): tp_dict
     <50f>   DW_AT_decl_file   : (data1) 8
     <510>   DW_AT_decl_line   : (data2) 406
     <512>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
     <516>   DW_AT_data_member_location: (data2) 264
  <2><518>: Abbrev Number: 16 (DW_TAG_member)
-    <519>   DW_AT_name        : (strp) (offset: 0x29b8): tp_descr_get
+    <519>   DW_AT_name        : (strp) (offset: 0x2a55): tp_descr_get
     <51d>   DW_AT_decl_file   : (data1) 8
     <51e>   DW_AT_decl_line   : (data2) 407
     <520>   DW_AT_type        : (ref4) <0xd34>, descrgetfunc, PyObject, _object
     <524>   DW_AT_data_member_location: (data2) 272
  <2><526>: Abbrev Number: 16 (DW_TAG_member)
-    <527>   DW_AT_name        : (strp) (offset: 0x32fd): tp_descr_set
+    <527>   DW_AT_name        : (strp) (offset: 0x339a): tp_descr_set
     <52b>   DW_AT_decl_file   : (data1) 8
     <52c>   DW_AT_decl_line   : (data2) 408
     <52e>   DW_AT_type        : (ref4) <0xd40>, descrsetfunc, int
     <532>   DW_AT_data_member_location: (data2) 280
  <2><534>: Abbrev Number: 16 (DW_TAG_member)
-    <535>   DW_AT_name        : (strp) (offset: 0xd88): tp_dictoffset
+    <535>   DW_AT_name        : (strp) (offset: 0xdd8): tp_dictoffset
     <539>   DW_AT_decl_file   : (data1) 8
     <53a>   DW_AT_decl_line   : (data2) 409
     <53c>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <540>   DW_AT_data_member_location: (data2) 288
  <2><542>: Abbrev Number: 16 (DW_TAG_member)
-    <543>   DW_AT_name        : (strp) (offset: 0xf70): tp_init
+    <543>   DW_AT_name        : (strp) (offset: 0xfc0): tp_init
     <547>   DW_AT_decl_file   : (data1) 8
     <548>   DW_AT_decl_line   : (data2) 410
     <54a>   DW_AT_type        : (ref4) <0xd4c>, initproc, int
     <54e>   DW_AT_data_member_location: (data2) 296
  <2><550>: Abbrev Number: 16 (DW_TAG_member)
-    <551>   DW_AT_name        : (strp) (offset: 0x1bd0): tp_alloc
+    <551>   DW_AT_name        : (strp) (offset: 0x1c37): tp_alloc
     <555>   DW_AT_decl_file   : (data1) 8
     <556>   DW_AT_decl_line   : (data2) 411
     <558>   DW_AT_type        : (ref4) <0xd83>, allocfunc, PyObject, _object
     <55c>   DW_AT_data_member_location: (data2) 304
  <2><55e>: Abbrev Number: 16 (DW_TAG_member)
-    <55f>   DW_AT_name        : (strp) (offset: 0x181e): tp_new
+    <55f>   DW_AT_name        : (strp) (offset: 0x1885): tp_new
     <563>   DW_AT_decl_file   : (data1) 8
     <564>   DW_AT_decl_line   : (data2) 412
     <566>   DW_AT_type        : (ref4) <0xd58>, newfunc, PyObject, _object
     <56a>   DW_AT_data_member_location: (data2) 312
  <2><56c>: Abbrev Number: 16 (DW_TAG_member)
-    <56d>   DW_AT_name        : (strp) (offset: 0x8bf): tp_free
+    <56d>   DW_AT_name        : (strp) (offset: 0x8ea): tp_free
     <571>   DW_AT_decl_file   : (data1) 8
     <572>   DW_AT_decl_line   : (data2) 413
     <574>   DW_AT_type        : (ref4) <0xbf0>, freefunc
     <578>   DW_AT_data_member_location: (data2) 320
  <2><57a>: Abbrev Number: 16 (DW_TAG_member)
-    <57b>   DW_AT_name        : (strp) (offset: 0x2dd): tp_is_gc
+    <57b>   DW_AT_name        : (strp) (offset: 0x2ee): tp_is_gc
     <57f>   DW_AT_decl_file   : (data1) 8
     <580>   DW_AT_decl_line   : (data2) 414
     <582>   DW_AT_type        : (ref4) <0x6ab>, inquiry, int
     <586>   DW_AT_data_member_location: (data2) 328
  <2><588>: Abbrev Number: 16 (DW_TAG_member)
-    <589>   DW_AT_name        : (strp) (offset: 0x442): tp_bases
+    <589>   DW_AT_name        : (strp) (offset: 0x453): tp_bases
     <58d>   DW_AT_decl_file   : (data1) 8
     <58e>   DW_AT_decl_line   : (data2) 415
     <590>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
     <594>   DW_AT_data_member_location: (data2) 336
  <2><596>: Abbrev Number: 16 (DW_TAG_member)
-    <597>   DW_AT_name        : (strp) (offset: 0x1e81): tp_mro
+    <597>   DW_AT_name        : (strp) (offset: 0x1ee8): tp_mro
     <59b>   DW_AT_decl_file   : (data1) 8
     <59c>   DW_AT_decl_line   : (data2) 416
     <59e>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
     <5a2>   DW_AT_data_member_location: (data2) 344
  <2><5a4>: Abbrev Number: 16 (DW_TAG_member)
-    <5a5>   DW_AT_name        : (strp) (offset: 0x2e33): tp_cache
+    <5a5>   DW_AT_name        : (strp) (offset: 0x2ed0): tp_cache
     <5a9>   DW_AT_decl_file   : (data1) 8
     <5aa>   DW_AT_decl_line   : (data2) 417
     <5ac>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
     <5b0>   DW_AT_data_member_location: (data2) 352
  <2><5b2>: Abbrev Number: 16 (DW_TAG_member)
-    <5b3>   DW_AT_name        : (strp) (offset: 0x2853): tp_subclasses
+    <5b3>   DW_AT_name        : (strp) (offset: 0x28f0): tp_subclasses
     <5b7>   DW_AT_decl_file   : (data1) 8
     <5b8>   DW_AT_decl_line   : (data2) 418
     <5ba>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
     <5be>   DW_AT_data_member_location: (data2) 360
  <2><5c0>: Abbrev Number: 16 (DW_TAG_member)
-    <5c1>   DW_AT_name        : (strp) (offset: 0x231f): tp_weaklist
+    <5c1>   DW_AT_name        : (strp) (offset: 0x23aa): tp_weaklist
     <5c5>   DW_AT_decl_file   : (data1) 8
     <5c6>   DW_AT_decl_line   : (data2) 419
     <5c8>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
     <5cc>   DW_AT_data_member_location: (data2) 368
  <2><5ce>: Abbrev Number: 16 (DW_TAG_member)
-    <5cf>   DW_AT_name        : (strp) (offset: 0x1996): tp_del
+    <5cf>   DW_AT_name        : (strp) (offset: 0x19fd): tp_del
     <5d3>   DW_AT_decl_file   : (data1) 8
     <5d4>   DW_AT_decl_line   : (data2) 420
     <5d6>   DW_AT_type        : (ref4) <0xc0d>, destructor
     <5da>   DW_AT_data_member_location: (data2) 376
  <2><5dc>: Abbrev Number: 16 (DW_TAG_member)
-    <5dd>   DW_AT_name        : (strp) (offset: 0x25c1): tp_version_tag
+    <5dd>   DW_AT_name        : (strp) (offset: 0x264c): tp_version_tag
     <5e1>   DW_AT_decl_file   : (data1) 8
     <5e2>   DW_AT_decl_line   : (data2) 423
     <5e4>   DW_AT_type        : (ref4) <0x49>, unsigned int
     <5e8>   DW_AT_data_member_location: (data2) 384
  <2><5ea>: Abbrev Number: 16 (DW_TAG_member)
-    <5eb>   DW_AT_name        : (strp) (offset: 0xdce): tp_finalize
+    <5eb>   DW_AT_name        : (strp) (offset: 0xe1e): tp_finalize
     <5ef>   DW_AT_decl_file   : (data1) 8
     <5f0>   DW_AT_decl_line   : (data2) 425
     <5f2>   DW_AT_type        : (ref4) <0xc0d>, destructor
     <5f6>   DW_AT_data_member_location: (data2) 392
  <2><5f8>: Abbrev Number: 0
  <1><5f9>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <5fa>   DW_AT_byte_size   : (data1) 8
     <5fb>   DW_AT_type        : (ref4) <0x368>, _typeobject
  <1><5ff>: Abbrev Number: 2 (DW_TAG_typedef)
-    <600>   DW_AT_name        : (strp) (offset: 0x14e6): PyObject
+    <600>   DW_AT_name        : (strp) (offset: 0x154d): PyObject
     <604>   DW_AT_decl_file   : (data1) 8
     <605>   DW_AT_decl_line   : (data1) 110
     <606>   DW_AT_type        : (ref4) <0x343>, _object
  <1><60a>: Abbrev Number: 17 (DW_TAG_structure_type)
     <60b>   DW_AT_byte_size   : (data1) 24
     <60c>   DW_AT_decl_file   : (data1) 8
     <60d>   DW_AT_decl_line   : (data1) 112
     <60e>   DW_AT_sibling     : (ref4) <0x62b>
  <2><612>: Abbrev Number: 8 (DW_TAG_member)
-    <613>   DW_AT_name        : (strp) (offset: 0xaab): ob_base
+    <613>   DW_AT_name        : (strp) (offset: 0xae6): ob_base
     <617>   DW_AT_decl_file   : (data1) 8
     <618>   DW_AT_decl_line   : (data1) 113
     <619>   DW_AT_type        : (ref4) <0x5ff>, PyObject, _object
     <61d>   DW_AT_data_member_location: (data1) 0
  <2><61e>: Abbrev Number: 8 (DW_TAG_member)
-    <61f>   DW_AT_name        : (strp) (offset: 0xfac): ob_size
+    <61f>   DW_AT_name        : (strp) (offset: 0xffc): ob_size
     <623>   DW_AT_decl_file   : (data1) 8
     <624>   DW_AT_decl_line   : (data1) 114
     <625>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <629>   DW_AT_data_member_location: (data1) 16
  <2><62a>: Abbrev Number: 0
  <1><62b>: Abbrev Number: 2 (DW_TAG_typedef)
-    <62c>   DW_AT_name        : (strp) (offset: 0x8f9): PyVarObject
+    <62c>   DW_AT_name        : (strp) (offset: 0x924): PyVarObject
     <630>   DW_AT_decl_file   : (data1) 8
     <631>   DW_AT_decl_line   : (data1) 115
     <632>   DW_AT_type        : (ref4) <0x60a>
  <1><636>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <637>   DW_AT_byte_size   : (data1) 8
     <638>   DW_AT_type        : (ref4) <0x5ff>, PyObject, _object
  <1><63c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <63d>   DW_AT_name        : (strp) (offset: 0x1f12): unaryfunc
+    <63d>   DW_AT_name        : (strp) (offset: 0x1f8c): unaryfunc
     <641>   DW_AT_decl_file   : (data1) 8
     <642>   DW_AT_decl_line   : (data1) 169
     <643>   DW_AT_type        : (ref4) <0x647>, PyObject, _object
  <1><647>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <648>   DW_AT_byte_size   : (data1) 8
     <649>   DW_AT_type        : (ref4) <0x64d>, PyObject, _object
  <1><64d>: Abbrev Number: 18 (DW_TAG_subroutine_type)
     <64e>   DW_AT_prototyped  : (flag_present) 1
     <64e>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
     <652>   DW_AT_sibling     : (ref4) <0x65c>
  <2><656>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <657>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><65b>: Abbrev Number: 0
  <1><65c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <65d>   DW_AT_name        : (strp) (offset: 0x1060): binaryfunc
+    <65d>   DW_AT_name        : (strp) (offset: 0x10b0): binaryfunc
     <661>   DW_AT_decl_file   : (data1) 8
     <662>   DW_AT_decl_line   : (data1) 170
     <663>   DW_AT_type        : (ref4) <0x667>, PyObject, _object
  <1><667>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <668>   DW_AT_byte_size   : (data1) 8
     <669>   DW_AT_type        : (ref4) <0x66d>, PyObject, _object
  <1><66d>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -772,15 +772,15 @@
     <672>   DW_AT_sibling     : (ref4) <0x681>
  <2><676>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <677>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><67b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <67c>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><680>: Abbrev Number: 0
  <1><681>: Abbrev Number: 2 (DW_TAG_typedef)
-    <682>   DW_AT_name        : (strp) (offset: 0xa72): ternaryfunc
+    <682>   DW_AT_name        : (strp) (offset: 0xaad): ternaryfunc
     <686>   DW_AT_decl_file   : (data1) 8
     <687>   DW_AT_decl_line   : (data1) 171
     <688>   DW_AT_type        : (ref4) <0x68c>, PyObject, _object
  <1><68c>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <68d>   DW_AT_byte_size   : (data1) 8
     <68e>   DW_AT_type        : (ref4) <0x692>, PyObject, _object
  <1><692>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -791,15 +791,15 @@
     <69c>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><6a0>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <6a1>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><6a5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <6a6>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><6aa>: Abbrev Number: 0
  <1><6ab>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6ac>   DW_AT_name        : (strp) (offset: 0x202a): inquiry
+    <6ac>   DW_AT_name        : (strp) (offset: 0x20a4): inquiry
     <6b0>   DW_AT_decl_file   : (data1) 8
     <6b1>   DW_AT_decl_line   : (data1) 172
     <6b2>   DW_AT_type        : (ref4) <0x6b6>, int
  <1><6b6>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <6b7>   DW_AT_byte_size   : (data1) 8
     <6b8>   DW_AT_type        : (ref4) <0x6bc>, int
  <1><6bc>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -821,15 +821,15 @@
     <6dd>   DW_AT_prototyped  : (flag_present) 1
     <6dd>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <6e1>   DW_AT_sibling     : (ref4) <0x6eb>
  <2><6e5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <6e6>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><6ea>: Abbrev Number: 0
  <1><6eb>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6ec>   DW_AT_name        : (strp) (offset: 0x1150): ssizeargfunc
+    <6ec>   DW_AT_name        : (strp) (offset: 0x11a0): ssizeargfunc
     <6f0>   DW_AT_decl_file   : (data1) 8
     <6f1>   DW_AT_decl_line   : (data1) 174
     <6f2>   DW_AT_type        : (ref4) <0x6f6>, PyObject, _object
  <1><6f6>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <6f7>   DW_AT_byte_size   : (data1) 8
     <6f8>   DW_AT_type        : (ref4) <0x6fc>, PyObject, _object
  <1><6fc>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -838,15 +838,15 @@
     <701>   DW_AT_sibling     : (ref4) <0x710>
  <2><705>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <706>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><70a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <70b>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><70f>: Abbrev Number: 0
  <1><710>: Abbrev Number: 2 (DW_TAG_typedef)
-    <711>   DW_AT_name        : (strp) (offset: 0x257b): ssizeobjargproc
+    <711>   DW_AT_name        : (strp) (offset: 0x2606): ssizeobjargproc
     <715>   DW_AT_decl_file   : (data1) 8
     <716>   DW_AT_decl_line   : (data1) 176
     <717>   DW_AT_type        : (ref4) <0x71b>, int
  <1><71b>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <71c>   DW_AT_byte_size   : (data1) 8
     <71d>   DW_AT_type        : (ref4) <0x721>, int
  <1><721>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -857,15 +857,15 @@
     <72b>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><72f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <730>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><734>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <735>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><739>: Abbrev Number: 0
  <1><73a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <73b>   DW_AT_name        : (strp) (offset: 0xf9e): objobjargproc
+    <73b>   DW_AT_name        : (strp) (offset: 0xfee): objobjargproc
     <73f>   DW_AT_decl_file   : (data1) 8
     <740>   DW_AT_decl_line   : (data1) 178
     <741>   DW_AT_type        : (ref4) <0x745>, int
  <1><745>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <746>   DW_AT_byte_size   : (data1) 8
     <747>   DW_AT_type        : (ref4) <0x74b>, int
  <1><74b>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -876,15 +876,15 @@
     <755>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><759>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <75a>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><75e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <75f>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><763>: Abbrev Number: 0
  <1><764>: Abbrev Number: 7 (DW_TAG_structure_type)
-    <765>   DW_AT_name        : (strp) (offset: 0x236e): bufferinfo
+    <765>   DW_AT_name        : (strp) (offset: 0x23f9): bufferinfo
     <769>   DW_AT_byte_size   : (data1) 80
     <76a>   DW_AT_decl_file   : (data1) 8
     <76b>   DW_AT_decl_line   : (data1) 182
     <76c>   DW_AT_sibling     : (ref4) <0x7f5>
  <2><770>: Abbrev Number: 20 (DW_TAG_member)
     <771>   DW_AT_name        : (string) buf
     <775>   DW_AT_decl_file   : (data1) 8
@@ -900,72 +900,72 @@
  <2><788>: Abbrev Number: 20 (DW_TAG_member)
     <789>   DW_AT_name        : (string) len
     <78d>   DW_AT_decl_file   : (data1) 8
     <78e>   DW_AT_decl_line   : (data1) 185
     <78f>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <793>   DW_AT_data_member_location: (data1) 16
  <2><794>: Abbrev Number: 8 (DW_TAG_member)
-    <795>   DW_AT_name        : (strp) (offset: 0x3da): itemsize
+    <795>   DW_AT_name        : (strp) (offset: 0x3eb): itemsize
     <799>   DW_AT_decl_file   : (data1) 8
     <79a>   DW_AT_decl_line   : (data1) 186
     <79b>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <79f>   DW_AT_data_member_location: (data1) 24
  <2><7a0>: Abbrev Number: 8 (DW_TAG_member)
-    <7a1>   DW_AT_name        : (strp) (offset: 0x221f): readonly
+    <7a1>   DW_AT_name        : (strp) (offset: 0x2299): readonly
     <7a5>   DW_AT_decl_file   : (data1) 8
     <7a6>   DW_AT_decl_line   : (data1) 188
     <7a7>   DW_AT_type        : (ref4) <0x5e>, int
     <7ab>   DW_AT_data_member_location: (data1) 32
  <2><7ac>: Abbrev Number: 8 (DW_TAG_member)
-    <7ad>   DW_AT_name        : (strp) (offset: 0x2576): ndim
+    <7ad>   DW_AT_name        : (strp) (offset: 0x2601): ndim
     <7b1>   DW_AT_decl_file   : (data1) 8
     <7b2>   DW_AT_decl_line   : (data1) 189
     <7b3>   DW_AT_type        : (ref4) <0x5e>, int
     <7b7>   DW_AT_data_member_location: (data1) 36
  <2><7b8>: Abbrev Number: 8 (DW_TAG_member)
-    <7b9>   DW_AT_name        : (strp) (offset: 0x1f0b): format
+    <7b9>   DW_AT_name        : (strp) (offset: 0x1f85): format
     <7bd>   DW_AT_decl_file   : (data1) 8
     <7be>   DW_AT_decl_line   : (data1) 190
     <7bf>   DW_AT_type        : (ref4) <0x96>, char
     <7c3>   DW_AT_data_member_location: (data1) 40
  <2><7c4>: Abbrev Number: 8 (DW_TAG_member)
-    <7c5>   DW_AT_name        : (strp) (offset: 0x251e): shape
+    <7c5>   DW_AT_name        : (strp) (offset: 0x25a9): shape
     <7c9>   DW_AT_decl_file   : (data1) 8
     <7ca>   DW_AT_decl_line   : (data1) 191
     <7cb>   DW_AT_type        : (ref4) <0x7f5>, Py_ssize_t, ssize_t, __ssize_t, long int
     <7cf>   DW_AT_data_member_location: (data1) 48
  <2><7d0>: Abbrev Number: 8 (DW_TAG_member)
-    <7d1>   DW_AT_name        : (strp) (offset: 0x2a46): strides
+    <7d1>   DW_AT_name        : (strp) (offset: 0x2ae3): strides
     <7d5>   DW_AT_decl_file   : (data1) 8
     <7d6>   DW_AT_decl_line   : (data1) 192
     <7d7>   DW_AT_type        : (ref4) <0x7f5>, Py_ssize_t, ssize_t, __ssize_t, long int
     <7db>   DW_AT_data_member_location: (data1) 56
  <2><7dc>: Abbrev Number: 8 (DW_TAG_member)
-    <7dd>   DW_AT_name        : (strp) (offset: 0x1c20): suboffsets
+    <7dd>   DW_AT_name        : (strp) (offset: 0x1c87): suboffsets
     <7e1>   DW_AT_decl_file   : (data1) 8
     <7e2>   DW_AT_decl_line   : (data1) 193
     <7e3>   DW_AT_type        : (ref4) <0x7f5>, Py_ssize_t, ssize_t, __ssize_t, long int
     <7e7>   DW_AT_data_member_location: (data1) 64
  <2><7e8>: Abbrev Number: 8 (DW_TAG_member)
-    <7e9>   DW_AT_name        : (strp) (offset: 0x2d14): internal
+    <7e9>   DW_AT_name        : (strp) (offset: 0x2db1): internal
     <7ed>   DW_AT_decl_file   : (data1) 8
     <7ee>   DW_AT_decl_line   : (data1) 194
     <7ef>   DW_AT_type        : (ref4) <0x89>
     <7f3>   DW_AT_data_member_location: (data1) 72
  <2><7f4>: Abbrev Number: 0
  <1><7f5>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <7f6>   DW_AT_byte_size   : (data1) 8
     <7f7>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><7fb>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7fc>   DW_AT_name        : (strp) (offset: 0x332d): Py_buffer
+    <7fc>   DW_AT_name        : (strp) (offset: 0x33ca): Py_buffer
     <800>   DW_AT_decl_file   : (data1) 8
     <801>   DW_AT_decl_line   : (data1) 195
     <802>   DW_AT_type        : (ref4) <0x764>, bufferinfo
  <1><806>: Abbrev Number: 2 (DW_TAG_typedef)
-    <807>   DW_AT_name        : (strp) (offset: 0x2627): getbufferproc
+    <807>   DW_AT_name        : (strp) (offset: 0x26b2): getbufferproc
     <80b>   DW_AT_decl_file   : (data1) 8
     <80c>   DW_AT_decl_line   : (data1) 197
     <80d>   DW_AT_type        : (ref4) <0x811>, int
  <1><811>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <812>   DW_AT_byte_size   : (data1) 8
     <813>   DW_AT_type        : (ref4) <0x817>, int
  <1><817>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -979,15 +979,15 @@
  <2><82a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <82b>   DW_AT_type        : (ref4) <0x5e>, int
  <2><82f>: Abbrev Number: 0
  <1><830>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <831>   DW_AT_byte_size   : (data1) 8
     <832>   DW_AT_type        : (ref4) <0x7fb>, Py_buffer, bufferinfo
  <1><836>: Abbrev Number: 2 (DW_TAG_typedef)
-    <837>   DW_AT_name        : (strp) (offset: 0x2b8c): releasebufferproc
+    <837>   DW_AT_name        : (strp) (offset: 0x2c29): releasebufferproc
     <83b>   DW_AT_decl_file   : (data1) 8
     <83c>   DW_AT_decl_line   : (data1) 198
     <83d>   DW_AT_type        : (ref4) <0x841>
  <1><841>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <842>   DW_AT_byte_size   : (data1) 8
     <843>   DW_AT_type        : (ref4) <0x847>
  <1><847>: Abbrev Number: 21 (DW_TAG_subroutine_type)
@@ -995,15 +995,15 @@
     <848>   DW_AT_sibling     : (ref4) <0x857>
  <2><84c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <84d>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><851>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <852>   DW_AT_type        : (ref4) <0x830>, Py_buffer, bufferinfo
  <2><856>: Abbrev Number: 0
  <1><857>: Abbrev Number: 2 (DW_TAG_typedef)
-    <858>   DW_AT_name        : (strp) (offset: 0x341b): objobjproc
+    <858>   DW_AT_name        : (strp) (offset: 0x34b8): objobjproc
     <85c>   DW_AT_decl_file   : (data1) 8
     <85d>   DW_AT_decl_line   : (data1) 235
     <85e>   DW_AT_type        : (ref4) <0x862>, int
  <1><862>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <863>   DW_AT_byte_size   : (data1) 8
     <864>   DW_AT_type        : (ref4) <0x868>, int
  <1><868>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1012,15 +1012,15 @@
     <86d>   DW_AT_sibling     : (ref4) <0x87c>
  <2><871>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <872>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><876>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <877>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><87b>: Abbrev Number: 0
  <1><87c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <87d>   DW_AT_name        : (strp) (offset: 0x78a): visitproc
+    <87d>   DW_AT_name        : (strp) (offset: 0x79b): visitproc
     <881>   DW_AT_decl_file   : (data1) 8
     <882>   DW_AT_decl_line   : (data1) 236
     <883>   DW_AT_type        : (ref4) <0x887>, int
  <1><887>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <888>   DW_AT_byte_size   : (data1) 8
     <889>   DW_AT_type        : (ref4) <0x88d>, int
  <1><88d>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1029,15 +1029,15 @@
     <892>   DW_AT_sibling     : (ref4) <0x8a1>
  <2><896>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <897>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><89b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <89c>   DW_AT_type        : (ref4) <0x89>
  <2><8a0>: Abbrev Number: 0
  <1><8a1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8a2>   DW_AT_name        : (strp) (offset: 0x1ff2): traverseproc
+    <8a2>   DW_AT_name        : (strp) (offset: 0x206c): traverseproc
     <8a6>   DW_AT_decl_file   : (data1) 8
     <8a7>   DW_AT_decl_line   : (data1) 237
     <8a8>   DW_AT_type        : (ref4) <0x8ac>, int
  <1><8ac>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <8ad>   DW_AT_byte_size   : (data1) 8
     <8ae>   DW_AT_type        : (ref4) <0x8b2>, int
  <1><8b2>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1059,411 +1059,411 @@
  <2><8d4>: Abbrev Number: 8 (DW_TAG_member)
     <8d5>   DW_AT_name        : (strp) (offset: 0x1a0): nb_add
     <8d9>   DW_AT_decl_file   : (data1) 8
     <8da>   DW_AT_decl_line   : (data1) 245
     <8db>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <8df>   DW_AT_data_member_location: (data1) 0
  <2><8e0>: Abbrev Number: 8 (DW_TAG_member)
-    <8e1>   DW_AT_name        : (strp) (offset: 0x30cf): nb_subtract
+    <8e1>   DW_AT_name        : (strp) (offset: 0x316c): nb_subtract
     <8e5>   DW_AT_decl_file   : (data1) 8
     <8e6>   DW_AT_decl_line   : (data1) 246
     <8e7>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <8eb>   DW_AT_data_member_location: (data1) 8
  <2><8ec>: Abbrev Number: 8 (DW_TAG_member)
-    <8ed>   DW_AT_name        : (strp) (offset: 0x28d9): nb_multiply
+    <8ed>   DW_AT_name        : (strp) (offset: 0x2976): nb_multiply
     <8f1>   DW_AT_decl_file   : (data1) 8
     <8f2>   DW_AT_decl_line   : (data1) 247
     <8f3>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <8f7>   DW_AT_data_member_location: (data1) 16
  <2><8f8>: Abbrev Number: 8 (DW_TAG_member)
-    <8f9>   DW_AT_name        : (strp) (offset: 0x77d): nb_remainder
+    <8f9>   DW_AT_name        : (strp) (offset: 0x78e): nb_remainder
     <8fd>   DW_AT_decl_file   : (data1) 8
     <8fe>   DW_AT_decl_line   : (data1) 248
     <8ff>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <903>   DW_AT_data_member_location: (data1) 24
  <2><904>: Abbrev Number: 8 (DW_TAG_member)
-    <905>   DW_AT_name        : (strp) (offset: 0x3411): nb_divmod
+    <905>   DW_AT_name        : (strp) (offset: 0x34ae): nb_divmod
     <909>   DW_AT_decl_file   : (data1) 8
     <90a>   DW_AT_decl_line   : (data1) 249
     <90b>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <90f>   DW_AT_data_member_location: (data1) 32
  <2><910>: Abbrev Number: 8 (DW_TAG_member)
-    <911>   DW_AT_name        : (strp) (offset: 0x2ff): nb_power
+    <911>   DW_AT_name        : (strp) (offset: 0x310): nb_power
     <915>   DW_AT_decl_file   : (data1) 8
     <916>   DW_AT_decl_line   : (data1) 250
     <917>   DW_AT_type        : (ref4) <0x681>, ternaryfunc, PyObject, _object
     <91b>   DW_AT_data_member_location: (data1) 40
  <2><91c>: Abbrev Number: 8 (DW_TAG_member)
-    <91d>   DW_AT_name        : (strp) (offset: 0x1519): nb_negative
+    <91d>   DW_AT_name        : (strp) (offset: 0x1580): nb_negative
     <921>   DW_AT_decl_file   : (data1) 8
     <922>   DW_AT_decl_line   : (data1) 251
     <923>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <927>   DW_AT_data_member_location: (data1) 48
  <2><928>: Abbrev Number: 8 (DW_TAG_member)
-    <929>   DW_AT_name        : (strp) (offset: 0x2401): nb_positive
+    <929>   DW_AT_name        : (strp) (offset: 0x248c): nb_positive
     <92d>   DW_AT_decl_file   : (data1) 8
     <92e>   DW_AT_decl_line   : (data1) 252
     <92f>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <933>   DW_AT_data_member_location: (data1) 56
  <2><934>: Abbrev Number: 8 (DW_TAG_member)
-    <935>   DW_AT_name        : (strp) (offset: 0x2c93): nb_absolute
+    <935>   DW_AT_name        : (strp) (offset: 0x2d30): nb_absolute
     <939>   DW_AT_decl_file   : (data1) 8
     <93a>   DW_AT_decl_line   : (data1) 253
     <93b>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <93f>   DW_AT_data_member_location: (data1) 64
  <2><940>: Abbrev Number: 8 (DW_TAG_member)
-    <941>   DW_AT_name        : (strp) (offset: 0xf24): nb_bool
+    <941>   DW_AT_name        : (strp) (offset: 0xf74): nb_bool
     <945>   DW_AT_decl_file   : (data1) 8
     <946>   DW_AT_decl_line   : (data1) 254
     <947>   DW_AT_type        : (ref4) <0x6ab>, inquiry, int
     <94b>   DW_AT_data_member_location: (data1) 72
  <2><94c>: Abbrev Number: 8 (DW_TAG_member)
-    <94d>   DW_AT_name        : (strp) (offset: 0x2045): nb_invert
+    <94d>   DW_AT_name        : (strp) (offset: 0x20bf): nb_invert
     <951>   DW_AT_decl_file   : (data1) 8
     <952>   DW_AT_decl_line   : (data1) 255
     <953>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <957>   DW_AT_data_member_location: (data1) 80
  <2><958>: Abbrev Number: 9 (DW_TAG_member)
-    <959>   DW_AT_name        : (strp) (offset: 0x2aa): nb_lshift
+    <959>   DW_AT_name        : (strp) (offset: 0x2bb): nb_lshift
     <95d>   DW_AT_decl_file   : (data1) 8
     <95e>   DW_AT_decl_line   : (data2) 256
     <960>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <964>   DW_AT_data_member_location: (data1) 88
  <2><965>: Abbrev Number: 9 (DW_TAG_member)
-    <966>   DW_AT_name        : (strp) (offset: 0x2aa2): nb_rshift
+    <966>   DW_AT_name        : (strp) (offset: 0x2b3f): nb_rshift
     <96a>   DW_AT_decl_file   : (data1) 8
     <96b>   DW_AT_decl_line   : (data2) 257
     <96d>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <971>   DW_AT_data_member_location: (data1) 96
  <2><972>: Abbrev Number: 9 (DW_TAG_member)
-    <973>   DW_AT_name        : (strp) (offset: 0x968): nb_and
+    <973>   DW_AT_name        : (strp) (offset: 0x993): nb_and
     <977>   DW_AT_decl_file   : (data1) 8
     <978>   DW_AT_decl_line   : (data2) 258
     <97a>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <97e>   DW_AT_data_member_location: (data1) 104
  <2><97f>: Abbrev Number: 9 (DW_TAG_member)
-    <980>   DW_AT_name        : (strp) (offset: 0x1506): nb_xor
+    <980>   DW_AT_name        : (strp) (offset: 0x156d): nb_xor
     <984>   DW_AT_decl_file   : (data1) 8
     <985>   DW_AT_decl_line   : (data2) 259
     <987>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <98b>   DW_AT_data_member_location: (data1) 112
  <2><98c>: Abbrev Number: 9 (DW_TAG_member)
-    <98d>   DW_AT_name        : (strp) (offset: 0x1eed): nb_or
+    <98d>   DW_AT_name        : (strp) (offset: 0x1f67): nb_or
     <991>   DW_AT_decl_file   : (data1) 8
     <992>   DW_AT_decl_line   : (data2) 260
     <994>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <998>   DW_AT_data_member_location: (data1) 120
  <2><999>: Abbrev Number: 9 (DW_TAG_member)
-    <99a>   DW_AT_name        : (strp) (offset: 0x32d0): nb_int
+    <99a>   DW_AT_name        : (strp) (offset: 0x336d): nb_int
     <99e>   DW_AT_decl_file   : (data1) 8
     <99f>   DW_AT_decl_line   : (data2) 261
     <9a1>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <9a5>   DW_AT_data_member_location: (data1) 128
  <2><9a6>: Abbrev Number: 9 (DW_TAG_member)
-    <9a7>   DW_AT_name        : (strp) (offset: 0x1279): nb_reserved
+    <9a7>   DW_AT_name        : (strp) (offset: 0x12c9): nb_reserved
     <9ab>   DW_AT_decl_file   : (data1) 8
     <9ac>   DW_AT_decl_line   : (data2) 262
     <9ae>   DW_AT_type        : (ref4) <0x89>
     <9b2>   DW_AT_data_member_location: (data1) 136
  <2><9b3>: Abbrev Number: 9 (DW_TAG_member)
-    <9b4>   DW_AT_name        : (strp) (offset: 0x1fc3): nb_float
+    <9b4>   DW_AT_name        : (strp) (offset: 0x203d): nb_float
     <9b8>   DW_AT_decl_file   : (data1) 8
     <9b9>   DW_AT_decl_line   : (data2) 263
     <9bb>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <9bf>   DW_AT_data_member_location: (data1) 144
  <2><9c0>: Abbrev Number: 9 (DW_TAG_member)
-    <9c1>   DW_AT_name        : (strp) (offset: 0x1254): nb_inplace_add
+    <9c1>   DW_AT_name        : (strp) (offset: 0x12a4): nb_inplace_add
     <9c5>   DW_AT_decl_file   : (data1) 8
     <9c6>   DW_AT_decl_line   : (data2) 265
     <9c8>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <9cc>   DW_AT_data_member_location: (data1) 152
  <2><9cd>: Abbrev Number: 9 (DW_TAG_member)
-    <9ce>   DW_AT_name        : (strp) (offset: 0x33b0): nb_inplace_subtract
+    <9ce>   DW_AT_name        : (strp) (offset: 0x344d): nb_inplace_subtract
     <9d2>   DW_AT_decl_file   : (data1) 8
     <9d3>   DW_AT_decl_line   : (data2) 266
     <9d5>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <9d9>   DW_AT_data_member_location: (data1) 160
  <2><9da>: Abbrev Number: 9 (DW_TAG_member)
-    <9db>   DW_AT_name        : (strp) (offset: 0x7f3): nb_inplace_multiply
+    <9db>   DW_AT_name        : (strp) (offset: 0x804): nb_inplace_multiply
     <9df>   DW_AT_decl_file   : (data1) 8
     <9e0>   DW_AT_decl_line   : (data2) 267
     <9e2>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <9e6>   DW_AT_data_member_location: (data1) 168
  <2><9e7>: Abbrev Number: 9 (DW_TAG_member)
-    <9e8>   DW_AT_name        : (strp) (offset: 0x2bb8): nb_inplace_remainder
+    <9e8>   DW_AT_name        : (strp) (offset: 0x2c55): nb_inplace_remainder
     <9ec>   DW_AT_decl_file   : (data1) 8
     <9ed>   DW_AT_decl_line   : (data2) 268
     <9ef>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <9f3>   DW_AT_data_member_location: (data1) 176
  <2><9f4>: Abbrev Number: 9 (DW_TAG_member)
-    <9f5>   DW_AT_name        : (strp) (offset: 0x2861): nb_inplace_power
+    <9f5>   DW_AT_name        : (strp) (offset: 0x28fe): nb_inplace_power
     <9f9>   DW_AT_decl_file   : (data1) 8
     <9fa>   DW_AT_decl_line   : (data2) 269
     <9fc>   DW_AT_type        : (ref4) <0x681>, ternaryfunc, PyObject, _object
     <a00>   DW_AT_data_member_location: (data1) 184
  <2><a01>: Abbrev Number: 9 (DW_TAG_member)
-    <a02>   DW_AT_name        : (strp) (offset: 0x58b): nb_inplace_lshift
+    <a02>   DW_AT_name        : (strp) (offset: 0x59c): nb_inplace_lshift
     <a06>   DW_AT_decl_file   : (data1) 8
     <a07>   DW_AT_decl_line   : (data2) 270
     <a09>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a0d>   DW_AT_data_member_location: (data1) 192
  <2><a0e>: Abbrev Number: 9 (DW_TAG_member)
-    <a0f>   DW_AT_name        : (strp) (offset: 0x2ea2): nb_inplace_rshift
+    <a0f>   DW_AT_name        : (strp) (offset: 0x2f3f): nb_inplace_rshift
     <a13>   DW_AT_decl_file   : (data1) 8
     <a14>   DW_AT_decl_line   : (data2) 271
     <a16>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a1a>   DW_AT_data_member_location: (data1) 200
  <2><a1b>: Abbrev Number: 9 (DW_TAG_member)
-    <a1c>   DW_AT_name        : (strp) (offset: 0x1ada): nb_inplace_and
+    <a1c>   DW_AT_name        : (strp) (offset: 0x1b41): nb_inplace_and
     <a20>   DW_AT_decl_file   : (data1) 8
     <a21>   DW_AT_decl_line   : (data2) 272
     <a23>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a27>   DW_AT_data_member_location: (data1) 208
  <2><a28>: Abbrev Number: 9 (DW_TAG_member)
-    <a29>   DW_AT_name        : (strp) (offset: 0x2844): nb_inplace_xor
+    <a29>   DW_AT_name        : (strp) (offset: 0x28e1): nb_inplace_xor
     <a2d>   DW_AT_decl_file   : (data1) 8
     <a2e>   DW_AT_decl_line   : (data2) 273
     <a30>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a34>   DW_AT_data_member_location: (data1) 216
  <2><a35>: Abbrev Number: 9 (DW_TAG_member)
-    <a36>   DW_AT_name        : (strp) (offset: 0x2d94): nb_inplace_or
+    <a36>   DW_AT_name        : (strp) (offset: 0x2e31): nb_inplace_or
     <a3a>   DW_AT_decl_file   : (data1) 8
     <a3b>   DW_AT_decl_line   : (data2) 274
     <a3d>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a41>   DW_AT_data_member_location: (data1) 224
  <2><a42>: Abbrev Number: 9 (DW_TAG_member)
-    <a43>   DW_AT_name        : (strp) (offset: 0x548): nb_floor_divide
+    <a43>   DW_AT_name        : (strp) (offset: 0x559): nb_floor_divide
     <a47>   DW_AT_decl_file   : (data1) 8
     <a48>   DW_AT_decl_line   : (data2) 276
     <a4a>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a4e>   DW_AT_data_member_location: (data1) 232
  <2><a4f>: Abbrev Number: 9 (DW_TAG_member)
-    <a50>   DW_AT_name        : (strp) (offset: 0x291f): nb_true_divide
+    <a50>   DW_AT_name        : (strp) (offset: 0x29bc): nb_true_divide
     <a54>   DW_AT_decl_file   : (data1) 8
     <a55>   DW_AT_decl_line   : (data2) 277
     <a57>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a5b>   DW_AT_data_member_location: (data1) 240
  <2><a5c>: Abbrev Number: 9 (DW_TAG_member)
-    <a5d>   DW_AT_name        : (strp) (offset: 0x2a05): nb_inplace_floor_divide
+    <a5d>   DW_AT_name        : (strp) (offset: 0x2aa2): nb_inplace_floor_divide
     <a61>   DW_AT_decl_file   : (data1) 8
     <a62>   DW_AT_decl_line   : (data2) 278
     <a64>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a68>   DW_AT_data_member_location: (data1) 248
  <2><a69>: Abbrev Number: 16 (DW_TAG_member)
-    <a6a>   DW_AT_name        : (strp) (offset: 0x1898): nb_inplace_true_divide
+    <a6a>   DW_AT_name        : (strp) (offset: 0x18ff): nb_inplace_true_divide
     <a6e>   DW_AT_decl_file   : (data1) 8
     <a6f>   DW_AT_decl_line   : (data2) 279
     <a71>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a75>   DW_AT_data_member_location: (data2) 256
  <2><a77>: Abbrev Number: 16 (DW_TAG_member)
-    <a78>   DW_AT_name        : (strp) (offset: 0x694): nb_index
+    <a78>   DW_AT_name        : (strp) (offset: 0x6a5): nb_index
     <a7c>   DW_AT_decl_file   : (data1) 8
     <a7d>   DW_AT_decl_line   : (data2) 281
     <a7f>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <a83>   DW_AT_data_member_location: (data2) 264
  <2><a85>: Abbrev Number: 16 (DW_TAG_member)
-    <a86>   DW_AT_name        : (strp) (offset: 0x284): nb_matrix_multiply
+    <a86>   DW_AT_name        : (strp) (offset: 0x295): nb_matrix_multiply
     <a8a>   DW_AT_decl_file   : (data1) 8
     <a8b>   DW_AT_decl_line   : (data2) 283
     <a8d>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a91>   DW_AT_data_member_location: (data2) 272
  <2><a93>: Abbrev Number: 16 (DW_TAG_member)
-    <a94>   DW_AT_name        : (strp) (offset: 0x3388): nb_inplace_matrix_multiply
+    <a94>   DW_AT_name        : (strp) (offset: 0x3425): nb_inplace_matrix_multiply
     <a98>   DW_AT_decl_file   : (data1) 8
     <a99>   DW_AT_decl_line   : (data2) 284
     <a9b>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <a9f>   DW_AT_data_member_location: (data2) 280
  <2><aa1>: Abbrev Number: 0
  <1><aa2>: Abbrev Number: 14 (DW_TAG_typedef)
-    <aa3>   DW_AT_name        : (strp) (offset: 0xda8): PyNumberMethods
+    <aa3>   DW_AT_name        : (strp) (offset: 0xdf8): PyNumberMethods
     <aa7>   DW_AT_decl_file   : (data1) 8
     <aa8>   DW_AT_decl_line   : (data2) 285
     <aaa>   DW_AT_type        : (ref4) <0x8cb>
  <1><aae>: Abbrev Number: 23 (DW_TAG_structure_type)
     <aaf>   DW_AT_byte_size   : (data1) 80
     <ab0>   DW_AT_decl_file   : (data1) 8
     <ab1>   DW_AT_decl_line   : (data2) 287
     <ab3>   DW_AT_sibling     : (ref4) <0xb3a>
  <2><ab7>: Abbrev Number: 9 (DW_TAG_member)
-    <ab8>   DW_AT_name        : (strp) (offset: 0x296c): sq_length
+    <ab8>   DW_AT_name        : (strp) (offset: 0x2a09): sq_length
     <abc>   DW_AT_decl_file   : (data1) 8
     <abd>   DW_AT_decl_line   : (data2) 288
     <abf>   DW_AT_type        : (ref4) <0x6cb>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <ac3>   DW_AT_data_member_location: (data1) 0
  <2><ac4>: Abbrev Number: 9 (DW_TAG_member)
-    <ac5>   DW_AT_name        : (strp) (offset: 0x3cd): sq_concat
+    <ac5>   DW_AT_name        : (strp) (offset: 0x3de): sq_concat
     <ac9>   DW_AT_decl_file   : (data1) 8
     <aca>   DW_AT_decl_line   : (data2) 289
     <acc>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <ad0>   DW_AT_data_member_location: (data1) 8
  <2><ad1>: Abbrev Number: 9 (DW_TAG_member)
-    <ad2>   DW_AT_name        : (strp) (offset: 0x35c): sq_repeat
+    <ad2>   DW_AT_name        : (strp) (offset: 0x36d): sq_repeat
     <ad6>   DW_AT_decl_file   : (data1) 8
     <ad7>   DW_AT_decl_line   : (data2) 290
     <ad9>   DW_AT_type        : (ref4) <0x6eb>, ssizeargfunc, PyObject, _object
     <add>   DW_AT_data_member_location: (data1) 16
  <2><ade>: Abbrev Number: 9 (DW_TAG_member)
     <adf>   DW_AT_name        : (strp) (offset: 0x170): sq_item
     <ae3>   DW_AT_decl_file   : (data1) 8
     <ae4>   DW_AT_decl_line   : (data2) 291
     <ae6>   DW_AT_type        : (ref4) <0x6eb>, ssizeargfunc, PyObject, _object
     <aea>   DW_AT_data_member_location: (data1) 24
  <2><aeb>: Abbrev Number: 9 (DW_TAG_member)
-    <aec>   DW_AT_name        : (strp) (offset: 0x869): was_sq_slice
+    <aec>   DW_AT_name        : (strp) (offset: 0x87a): was_sq_slice
     <af0>   DW_AT_decl_file   : (data1) 8
     <af1>   DW_AT_decl_line   : (data2) 292
     <af3>   DW_AT_type        : (ref4) <0x89>
     <af7>   DW_AT_data_member_location: (data1) 32
  <2><af8>: Abbrev Number: 9 (DW_TAG_member)
     <af9>   DW_AT_name        : (strp) (offset: 0x20c): sq_ass_item
     <afd>   DW_AT_decl_file   : (data1) 8
     <afe>   DW_AT_decl_line   : (data2) 293
     <b00>   DW_AT_type        : (ref4) <0x710>, ssizeobjargproc, int
     <b04>   DW_AT_data_member_location: (data1) 40
  <2><b05>: Abbrev Number: 9 (DW_TAG_member)
-    <b06>   DW_AT_name        : (strp) (offset: 0xa2c): was_sq_ass_slice
+    <b06>   DW_AT_name        : (strp) (offset: 0xa67): was_sq_ass_slice
     <b0a>   DW_AT_decl_file   : (data1) 8
     <b0b>   DW_AT_decl_line   : (data2) 294
     <b0d>   DW_AT_type        : (ref4) <0x89>
     <b11>   DW_AT_data_member_location: (data1) 48
  <2><b12>: Abbrev Number: 9 (DW_TAG_member)
-    <b13>   DW_AT_name        : (strp) (offset: 0xb7b): sq_contains
+    <b13>   DW_AT_name        : (strp) (offset: 0xbb6): sq_contains
     <b17>   DW_AT_decl_file   : (data1) 8
     <b18>   DW_AT_decl_line   : (data2) 295
     <b1a>   DW_AT_type        : (ref4) <0x857>, objobjproc, int
     <b1e>   DW_AT_data_member_location: (data1) 56
  <2><b1f>: Abbrev Number: 9 (DW_TAG_member)
-    <b20>   DW_AT_name        : (strp) (offset: 0x2c3): sq_inplace_concat
+    <b20>   DW_AT_name        : (strp) (offset: 0x2d4): sq_inplace_concat
     <b24>   DW_AT_decl_file   : (data1) 8
     <b25>   DW_AT_decl_line   : (data2) 297
     <b27>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <b2b>   DW_AT_data_member_location: (data1) 64
  <2><b2c>: Abbrev Number: 9 (DW_TAG_member)
-    <b2d>   DW_AT_name        : (strp) (offset: 0x245): sq_inplace_repeat
+    <b2d>   DW_AT_name        : (strp) (offset: 0x256): sq_inplace_repeat
     <b31>   DW_AT_decl_file   : (data1) 8
     <b32>   DW_AT_decl_line   : (data2) 298
     <b34>   DW_AT_type        : (ref4) <0x6eb>, ssizeargfunc, PyObject, _object
     <b38>   DW_AT_data_member_location: (data1) 72
  <2><b39>: Abbrev Number: 0
  <1><b3a>: Abbrev Number: 14 (DW_TAG_typedef)
-    <b3b>   DW_AT_name        : (strp) (offset: 0x22b2): PySequenceMethods
+    <b3b>   DW_AT_name        : (strp) (offset: 0x233d): PySequenceMethods
     <b3f>   DW_AT_decl_file   : (data1) 8
     <b40>   DW_AT_decl_line   : (data2) 299
     <b42>   DW_AT_type        : (ref4) <0xaae>
  <1><b46>: Abbrev Number: 23 (DW_TAG_structure_type)
     <b47>   DW_AT_byte_size   : (data1) 24
     <b48>   DW_AT_decl_file   : (data1) 8
     <b49>   DW_AT_decl_line   : (data2) 301
     <b4b>   DW_AT_sibling     : (ref4) <0xb77>
  <2><b4f>: Abbrev Number: 9 (DW_TAG_member)
-    <b50>   DW_AT_name        : (strp) (offset: 0x27a9): mp_length
+    <b50>   DW_AT_name        : (strp) (offset: 0x2846): mp_length
     <b54>   DW_AT_decl_file   : (data1) 8
     <b55>   DW_AT_decl_line   : (data2) 302
     <b57>   DW_AT_type        : (ref4) <0x6cb>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <b5b>   DW_AT_data_member_location: (data1) 0
  <2><b5c>: Abbrev Number: 9 (DW_TAG_member)
-    <b5d>   DW_AT_name        : (strp) (offset: 0xe53): mp_subscript
+    <b5d>   DW_AT_name        : (strp) (offset: 0xea3): mp_subscript
     <b61>   DW_AT_decl_file   : (data1) 8
     <b62>   DW_AT_decl_line   : (data2) 303
     <b64>   DW_AT_type        : (ref4) <0x65c>, binaryfunc, PyObject, _object
     <b68>   DW_AT_data_member_location: (data1) 8
  <2><b69>: Abbrev Number: 9 (DW_TAG_member)
-    <b6a>   DW_AT_name        : (strp) (offset: 0xcd2): mp_ass_subscript
+    <b6a>   DW_AT_name        : (strp) (offset: 0xd22): mp_ass_subscript
     <b6e>   DW_AT_decl_file   : (data1) 8
     <b6f>   DW_AT_decl_line   : (data2) 304
     <b71>   DW_AT_type        : (ref4) <0x73a>, objobjargproc, int
     <b75>   DW_AT_data_member_location: (data1) 16
  <2><b76>: Abbrev Number: 0
  <1><b77>: Abbrev Number: 14 (DW_TAG_typedef)
-    <b78>   DW_AT_name        : (strp) (offset: 0x2f49): PyMappingMethods
+    <b78>   DW_AT_name        : (strp) (offset: 0x2fe6): PyMappingMethods
     <b7c>   DW_AT_decl_file   : (data1) 8
     <b7d>   DW_AT_decl_line   : (data2) 305
     <b7f>   DW_AT_type        : (ref4) <0xb46>
  <1><b83>: Abbrev Number: 23 (DW_TAG_structure_type)
     <b84>   DW_AT_byte_size   : (data1) 24
     <b85>   DW_AT_decl_file   : (data1) 8
     <b86>   DW_AT_decl_line   : (data2) 307
     <b88>   DW_AT_sibling     : (ref4) <0xbb4>
  <2><b8c>: Abbrev Number: 9 (DW_TAG_member)
-    <b8d>   DW_AT_name        : (strp) (offset: 0x26f5): am_await
+    <b8d>   DW_AT_name        : (strp) (offset: 0x2792): am_await
     <b91>   DW_AT_decl_file   : (data1) 8
     <b92>   DW_AT_decl_line   : (data2) 308
     <b94>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <b98>   DW_AT_data_member_location: (data1) 0
  <2><b99>: Abbrev Number: 9 (DW_TAG_member)
-    <b9a>   DW_AT_name        : (strp) (offset: 0x2814): am_aiter
+    <b9a>   DW_AT_name        : (strp) (offset: 0x28b1): am_aiter
     <b9e>   DW_AT_decl_file   : (data1) 8
     <b9f>   DW_AT_decl_line   : (data2) 309
     <ba1>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <ba5>   DW_AT_data_member_location: (data1) 8
  <2><ba6>: Abbrev Number: 9 (DW_TAG_member)
-    <ba7>   DW_AT_name        : (strp) (offset: 0x32d): am_anext
+    <ba7>   DW_AT_name        : (strp) (offset: 0x33e): am_anext
     <bab>   DW_AT_decl_file   : (data1) 8
     <bac>   DW_AT_decl_line   : (data2) 310
     <bae>   DW_AT_type        : (ref4) <0x63c>, unaryfunc, PyObject, _object
     <bb2>   DW_AT_data_member_location: (data1) 16
  <2><bb3>: Abbrev Number: 0
  <1><bb4>: Abbrev Number: 14 (DW_TAG_typedef)
-    <bb5>   DW_AT_name        : (strp) (offset: 0x2160): PyAsyncMethods
+    <bb5>   DW_AT_name        : (strp) (offset: 0x21da): PyAsyncMethods
     <bb9>   DW_AT_decl_file   : (data1) 8
     <bba>   DW_AT_decl_line   : (data2) 311
     <bbc>   DW_AT_type        : (ref4) <0xb83>
  <1><bc0>: Abbrev Number: 23 (DW_TAG_structure_type)
     <bc1>   DW_AT_byte_size   : (data1) 16
     <bc2>   DW_AT_decl_file   : (data1) 8
     <bc3>   DW_AT_decl_line   : (data2) 313
     <bc5>   DW_AT_sibling     : (ref4) <0xbe4>
  <2><bc9>: Abbrev Number: 9 (DW_TAG_member)
-    <bca>   DW_AT_name        : (strp) (offset: 0x111a): bf_getbuffer
+    <bca>   DW_AT_name        : (strp) (offset: 0x116a): bf_getbuffer
     <bce>   DW_AT_decl_file   : (data1) 8
     <bcf>   DW_AT_decl_line   : (data2) 314
     <bd1>   DW_AT_type        : (ref4) <0x806>, getbufferproc, int
     <bd5>   DW_AT_data_member_location: (data1) 0
  <2><bd6>: Abbrev Number: 9 (DW_TAG_member)
-    <bd7>   DW_AT_name        : (strp) (offset: 0x2b1e): bf_releasebuffer
+    <bd7>   DW_AT_name        : (strp) (offset: 0x2bbb): bf_releasebuffer
     <bdb>   DW_AT_decl_file   : (data1) 8
     <bdc>   DW_AT_decl_line   : (data2) 315
     <bde>   DW_AT_type        : (ref4) <0x836>, releasebufferproc
     <be2>   DW_AT_data_member_location: (data1) 8
  <2><be3>: Abbrev Number: 0
  <1><be4>: Abbrev Number: 14 (DW_TAG_typedef)
-    <be5>   DW_AT_name        : (strp) (offset: 0x17fa): PyBufferProcs
+    <be5>   DW_AT_name        : (strp) (offset: 0x1861): PyBufferProcs
     <be9>   DW_AT_decl_file   : (data1) 8
     <bea>   DW_AT_decl_line   : (data2) 316
     <bec>   DW_AT_type        : (ref4) <0xbc0>
  <1><bf0>: Abbrev Number: 14 (DW_TAG_typedef)
-    <bf1>   DW_AT_name        : (strp) (offset: 0x28c5): freefunc
+    <bf1>   DW_AT_name        : (strp) (offset: 0x2962): freefunc
     <bf5>   DW_AT_decl_file   : (data1) 8
     <bf6>   DW_AT_decl_line   : (data2) 319
     <bf8>   DW_AT_type        : (ref4) <0xbfc>
  <1><bfc>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <bfd>   DW_AT_byte_size   : (data1) 8
     <bfe>   DW_AT_type        : (ref4) <0xc02>
  <1><c02>: Abbrev Number: 21 (DW_TAG_subroutine_type)
     <c03>   DW_AT_prototyped  : (flag_present) 1
     <c03>   DW_AT_sibling     : (ref4) <0xc0d>
  <2><c07>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <c08>   DW_AT_type        : (ref4) <0x89>
  <2><c0c>: Abbrev Number: 0
  <1><c0d>: Abbrev Number: 14 (DW_TAG_typedef)
-    <c0e>   DW_AT_name        : (strp) (offset: 0x18c6): destructor
+    <c0e>   DW_AT_name        : (strp) (offset: 0x192d): destructor
     <c12>   DW_AT_decl_file   : (data1) 8
     <c13>   DW_AT_decl_line   : (data2) 320
     <c15>   DW_AT_type        : (ref4) <0xc19>
  <1><c19>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <c1a>   DW_AT_byte_size   : (data1) 8
     <c1b>   DW_AT_type        : (ref4) <0xc1f>
  <1><c1f>: Abbrev Number: 21 (DW_TAG_subroutine_type)
     <c20>   DW_AT_prototyped  : (flag_present) 1
     <c20>   DW_AT_sibling     : (ref4) <0xc2a>
  <2><c24>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <c25>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><c29>: Abbrev Number: 0
  <1><c2a>: Abbrev Number: 14 (DW_TAG_typedef)
-    <c2b>   DW_AT_name        : (strp) (offset: 0x1665): printfunc
+    <c2b>   DW_AT_name        : (strp) (offset: 0x16cc): printfunc
     <c2f>   DW_AT_decl_file   : (data1) 8
     <c30>   DW_AT_decl_line   : (data2) 326
     <c32>   DW_AT_type        : (ref4) <0xc36>, int
  <1><c36>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <c37>   DW_AT_byte_size   : (data1) 8
     <c38>   DW_AT_type        : (ref4) <0xc3c>, int
  <1><c3c>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1477,15 +1477,15 @@
  <2><c4f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <c50>   DW_AT_type        : (ref4) <0x5e>, int
  <2><c54>: Abbrev Number: 0
  <1><c55>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <c56>   DW_AT_byte_size   : (data1) 8
     <c57>   DW_AT_type        : (ref4) <0xa3>, FILE, _IO_FILE
  <1><c5b>: Abbrev Number: 14 (DW_TAG_typedef)
-    <c5c>   DW_AT_name        : (strp) (offset: 0x2416): getattrfunc
+    <c5c>   DW_AT_name        : (strp) (offset: 0x24a1): getattrfunc
     <c60>   DW_AT_decl_file   : (data1) 8
     <c61>   DW_AT_decl_line   : (data2) 328
     <c63>   DW_AT_type        : (ref4) <0xc67>, PyObject, _object
  <1><c67>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <c68>   DW_AT_byte_size   : (data1) 8
     <c69>   DW_AT_type        : (ref4) <0xc6d>, PyObject, _object
  <1><c6d>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1494,20 +1494,20 @@
     <c72>   DW_AT_sibling     : (ref4) <0xc81>
  <2><c76>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <c77>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><c7b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <c7c>   DW_AT_type        : (ref4) <0x96>, char
  <2><c80>: Abbrev Number: 0
  <1><c81>: Abbrev Number: 14 (DW_TAG_typedef)
-    <c82>   DW_AT_name        : (strp) (offset: 0x222f): getattrofunc
+    <c82>   DW_AT_name        : (strp) (offset: 0x22a9): getattrofunc
     <c86>   DW_AT_decl_file   : (data1) 8
     <c87>   DW_AT_decl_line   : (data2) 329
     <c89>   DW_AT_type        : (ref4) <0x667>, PyObject, _object
  <1><c8d>: Abbrev Number: 14 (DW_TAG_typedef)
-    <c8e>   DW_AT_name        : (strp) (offset: 0xff4): setattrfunc
+    <c8e>   DW_AT_name        : (strp) (offset: 0x1044): setattrfunc
     <c92>   DW_AT_decl_file   : (data1) 8
     <c93>   DW_AT_decl_line   : (data2) 330
     <c95>   DW_AT_type        : (ref4) <0xc99>, int
  <1><c99>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <c9a>   DW_AT_byte_size   : (data1) 8
     <c9b>   DW_AT_type        : (ref4) <0xc9f>, int
  <1><c9f>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1518,40 +1518,40 @@
     <ca9>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><cad>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <cae>   DW_AT_type        : (ref4) <0x96>, char
  <2><cb2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <cb3>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><cb7>: Abbrev Number: 0
  <1><cb8>: Abbrev Number: 14 (DW_TAG_typedef)
-    <cb9>   DW_AT_name        : (strp) (offset: 0x495): setattrofunc
+    <cb9>   DW_AT_name        : (strp) (offset: 0x4a6): setattrofunc
     <cbd>   DW_AT_decl_file   : (data1) 8
     <cbe>   DW_AT_decl_line   : (data2) 331
     <cc0>   DW_AT_type        : (ref4) <0x745>, int
  <1><cc4>: Abbrev Number: 14 (DW_TAG_typedef)
-    <cc5>   DW_AT_name        : (strp) (offset: 0x1330): reprfunc
+    <cc5>   DW_AT_name        : (strp) (offset: 0x1380): reprfunc
     <cc9>   DW_AT_decl_file   : (data1) 8
     <cca>   DW_AT_decl_line   : (data2) 332
     <ccc>   DW_AT_type        : (ref4) <0x647>, PyObject, _object
  <1><cd0>: Abbrev Number: 14 (DW_TAG_typedef)
-    <cd1>   DW_AT_name        : (strp) (offset: 0x240d): hashfunc
+    <cd1>   DW_AT_name        : (strp) (offset: 0x2498): hashfunc
     <cd5>   DW_AT_decl_file   : (data1) 8
     <cd6>   DW_AT_decl_line   : (data2) 333
     <cd8>   DW_AT_type        : (ref4) <0xcdc>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><cdc>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <cdd>   DW_AT_byte_size   : (data1) 8
     <cde>   DW_AT_type        : (ref4) <0xce2>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><ce2>: Abbrev Number: 18 (DW_TAG_subroutine_type)
     <ce3>   DW_AT_prototyped  : (flag_present) 1
     <ce3>   DW_AT_type        : (ref4) <0x32a>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <ce7>   DW_AT_sibling     : (ref4) <0xcf1>
  <2><ceb>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <cec>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><cf0>: Abbrev Number: 0
  <1><cf1>: Abbrev Number: 14 (DW_TAG_typedef)
-    <cf2>   DW_AT_name        : (strp) (offset: 0xc83): richcmpfunc
+    <cf2>   DW_AT_name        : (strp) (offset: 0xcd3): richcmpfunc
     <cf6>   DW_AT_decl_file   : (data1) 8
     <cf7>   DW_AT_decl_line   : (data2) 334
     <cf9>   DW_AT_type        : (ref4) <0xcfd>, PyObject, _object
  <1><cfd>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <cfe>   DW_AT_byte_size   : (data1) 8
     <cff>   DW_AT_type        : (ref4) <0xd03>, PyObject, _object
  <1><d03>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1562,40 +1562,40 @@
     <d0d>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><d11>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <d12>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><d16>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <d17>   DW_AT_type        : (ref4) <0x5e>, int
  <2><d1b>: Abbrev Number: 0
  <1><d1c>: Abbrev Number: 14 (DW_TAG_typedef)
-    <d1d>   DW_AT_name        : (strp) (offset: 0x1136): getiterfunc
+    <d1d>   DW_AT_name        : (strp) (offset: 0x1186): getiterfunc
     <d21>   DW_AT_decl_file   : (data1) 8
     <d22>   DW_AT_decl_line   : (data2) 335
     <d24>   DW_AT_type        : (ref4) <0x647>, PyObject, _object
  <1><d28>: Abbrev Number: 14 (DW_TAG_typedef)
-    <d29>   DW_AT_name        : (strp) (offset: 0x3294): iternextfunc
+    <d29>   DW_AT_name        : (strp) (offset: 0x3331): iternextfunc
     <d2d>   DW_AT_decl_file   : (data1) 8
     <d2e>   DW_AT_decl_line   : (data2) 336
     <d30>   DW_AT_type        : (ref4) <0x647>, PyObject, _object
  <1><d34>: Abbrev Number: 14 (DW_TAG_typedef)
-    <d35>   DW_AT_name        : (strp) (offset: 0x1227): descrgetfunc
+    <d35>   DW_AT_name        : (strp) (offset: 0x1277): descrgetfunc
     <d39>   DW_AT_decl_file   : (data1) 8
     <d3a>   DW_AT_decl_line   : (data2) 337
     <d3c>   DW_AT_type        : (ref4) <0x68c>, PyObject, _object
  <1><d40>: Abbrev Number: 14 (DW_TAG_typedef)
-    <d41>   DW_AT_name        : (strp) (offset: 0x1194): descrsetfunc
+    <d41>   DW_AT_name        : (strp) (offset: 0x11e4): descrsetfunc
     <d45>   DW_AT_decl_file   : (data1) 8
     <d46>   DW_AT_decl_line   : (data2) 338
     <d48>   DW_AT_type        : (ref4) <0x745>, int
  <1><d4c>: Abbrev Number: 14 (DW_TAG_typedef)
-    <d4d>   DW_AT_name        : (strp) (offset: 0x3f4): initproc
+    <d4d>   DW_AT_name        : (strp) (offset: 0x405): initproc
     <d51>   DW_AT_decl_file   : (data1) 8
     <d52>   DW_AT_decl_line   : (data2) 339
     <d54>   DW_AT_type        : (ref4) <0x745>, int
  <1><d58>: Abbrev Number: 14 (DW_TAG_typedef)
-    <d59>   DW_AT_name        : (strp) (offset: 0x2269): newfunc
+    <d59>   DW_AT_name        : (strp) (offset: 0x22e3): newfunc
     <d5d>   DW_AT_decl_file   : (data1) 8
     <d5e>   DW_AT_decl_line   : (data2) 340
     <d60>   DW_AT_type        : (ref4) <0xd64>, PyObject, _object
  <1><d64>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <d65>   DW_AT_byte_size   : (data1) 8
     <d66>   DW_AT_type        : (ref4) <0xd6a>, PyObject, _object
  <1><d6a>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1606,15 +1606,15 @@
     <d74>   DW_AT_type        : (ref4) <0x5f9>, _typeobject
  <2><d78>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <d79>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><d7d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <d7e>   DW_AT_type        : (ref4) <0x636>, PyObject, _object
  <2><d82>: Abbrev Number: 0
  <1><d83>: Abbrev Number: 14 (DW_TAG_typedef)
-    <d84>   DW_AT_name        : (strp) (offset: 0x1d8c): allocfunc
+    <d84>   DW_AT_name        : (strp) (offset: 0x1df3): allocfunc
     <d88>   DW_AT_decl_file   : (data1) 8
     <d89>   DW_AT_decl_line   : (data2) 341
     <d8b>   DW_AT_type        : (ref4) <0xd8f>, PyObject, _object
  <1><d8f>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <d90>   DW_AT_byte_size   : (data1) 8
     <d91>   DW_AT_type        : (ref4) <0xd95>, PyObject, _object
  <1><d95>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1638,73 +1638,73 @@
  <1><dbb>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <dbc>   DW_AT_byte_size   : (data1) 8
     <dbd>   DW_AT_type        : (ref4) <0xb77>, PyMappingMethods
  <1><dc1>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <dc2>   DW_AT_byte_size   : (data1) 8
     <dc3>   DW_AT_type        : (ref4) <0xbe4>, PyBufferProcs
  <1><dc7>: Abbrev Number: 7 (DW_TAG_structure_type)
-    <dc8>   DW_AT_name        : (strp) (offset: 0xdc2): PyMethodDef
+    <dc8>   DW_AT_name        : (strp) (offset: 0xe12): PyMethodDef
     <dcc>   DW_AT_byte_size   : (data1) 32
     <dcd>   DW_AT_decl_file   : (data1) 9
     <dce>   DW_AT_decl_line   : (data1) 54
     <dcf>   DW_AT_sibling     : (ref4) <0xe04>
  <2><dd3>: Abbrev Number: 8 (DW_TAG_member)
-    <dd4>   DW_AT_name        : (strp) (offset: 0x208a): ml_name
+    <dd4>   DW_AT_name        : (strp) (offset: 0x2104): ml_name
     <dd8>   DW_AT_decl_file   : (data1) 9
     <dd9>   DW_AT_decl_line   : (data1) 55
     <dda>   DW_AT_type        : (ref4) <0x2a9>, char
     <dde>   DW_AT_data_member_location: (data1) 0
  <2><ddf>: Abbrev Number: 8 (DW_TAG_member)
-    <de0>   DW_AT_name        : (strp) (offset: 0x21ec): ml_meth
+    <de0>   DW_AT_name        : (strp) (offset: 0x2266): ml_meth
     <de4>   DW_AT_decl_file   : (data1) 9
     <de5>   DW_AT_decl_line   : (data1) 56
     <de6>   DW_AT_type        : (ref4) <0x108a>, PyCFunction, PyObject, _object
     <dea>   DW_AT_data_member_location: (data1) 8
  <2><deb>: Abbrev Number: 8 (DW_TAG_member)
-    <dec>   DW_AT_name        : (strp) (offset: 0x1815): ml_flags
+    <dec>   DW_AT_name        : (strp) (offset: 0x187c): ml_flags
     <df0>   DW_AT_decl_file   : (data1) 9
     <df1>   DW_AT_decl_line   : (data1) 57
     <df2>   DW_AT_type        : (ref4) <0x5e>, int
     <df6>   DW_AT_data_member_location: (data1) 16
  <2><df7>: Abbrev Number: 8 (DW_TAG_member)
-    <df8>   DW_AT_name        : (strp) (offset: 0x206f): ml_doc
+    <df8>   DW_AT_name        : (strp) (offset: 0x20e9): ml_doc
     <dfc>   DW_AT_decl_file   : (data1) 9
     <dfd>   DW_AT_decl_line   : (data1) 59
     <dfe>   DW_AT_type        : (ref4) <0x2a9>, char
     <e02>   DW_AT_data_member_location: (data1) 24
  <2><e03>: Abbrev Number: 0
  <1><e04>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <e05>   DW_AT_byte_size   : (data1) 8
     <e06>   DW_AT_type        : (ref4) <0xdc7>, PyMethodDef
  <1><e0a>: Abbrev Number: 7 (DW_TAG_structure_type)
-    <e0b>   DW_AT_name        : (strp) (offset: 0x876): PyMemberDef
+    <e0b>   DW_AT_name        : (strp) (offset: 0x887): PyMemberDef
     <e0f>   DW_AT_byte_size   : (data1) 40
     <e10>   DW_AT_decl_file   : (data1) 10
     <e11>   DW_AT_decl_line   : (data1) 18
     <e12>   DW_AT_sibling     : (ref4) <0xe53>
  <2><e16>: Abbrev Number: 8 (DW_TAG_member)
-    <e17>   DW_AT_name        : (strp) (offset: 0x25ef): name
+    <e17>   DW_AT_name        : (strp) (offset: 0x267a): name
     <e1b>   DW_AT_decl_file   : (data1) 10
     <e1c>   DW_AT_decl_line   : (data1) 19
     <e1d>   DW_AT_type        : (ref4) <0x96>, char
     <e21>   DW_AT_data_member_location: (data1) 0
  <2><e22>: Abbrev Number: 8 (DW_TAG_member)
-    <e23>   DW_AT_name        : (strp) (offset: 0x898): type
+    <e23>   DW_AT_name        : (strp) (offset: 0x8c3): type
     <e27>   DW_AT_decl_file   : (data1) 10
     <e28>   DW_AT_decl_line   : (data1) 20
     <e29>   DW_AT_type        : (ref4) <0x5e>, int
     <e2d>   DW_AT_data_member_location: (data1) 8
  <2><e2e>: Abbrev Number: 8 (DW_TAG_member)
-    <e2f>   DW_AT_name        : (strp) (offset: 0x2e9b): offset
+    <e2f>   DW_AT_name        : (strp) (offset: 0x2f38): offset
     <e33>   DW_AT_decl_file   : (data1) 10
     <e34>   DW_AT_decl_line   : (data1) 21
     <e35>   DW_AT_type        : (ref4) <0x31f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <e39>   DW_AT_data_member_location: (data1) 16
  <2><e3a>: Abbrev Number: 8 (DW_TAG_member)
-    <e3b>   DW_AT_name        : (strp) (offset: 0x1818): flags
+    <e3b>   DW_AT_name        : (strp) (offset: 0x187f): flags
     <e3f>   DW_AT_decl_file   : (data1) 10
     <e40>   DW_AT_decl_line   : (data1) 22
     <e41>   DW_AT_type        : (ref4) <0x5e>, int
