# Comparing `tmp/OpsApi-1.0.1.tar.gz` & `tmp/OpsApi-2.0.0.tar.gz`

## filetype from file(1)

```diff
@@ -1 +1 @@
-gzip compressed data, was "dist/OpsApi-1.0.1.tar", last modified: Sun Apr  7 10:13:16 2024, max compression
+gzip compressed data, was "dist/OpsApi-2.0.0.tar", last modified: Mon Apr  8 02:30:58 2024, max compression
```

## Comparing `OpsApi-1.0.1.tar` & `OpsApi-2.0.0.tar`

### file list

```diff
@@ -1,15 +1,15 @@
-drwxr-xr-x   0 root         (0) root         (0)        0 2024-04-07 10:13:16.000000 OpsApi-1.0.1/
--rw-r--r--   0 root         (0) root         (0)      221 2024-04-07 10:13:16.000000 OpsApi-1.0.1/PKG-INFO
-drwxr-xr-x   0 root         (0) root         (0)        0 2024-04-07 10:13:16.000000 OpsApi-1.0.1/OpsApi.egg-info/
--rw-r--r--   0 root         (0) root         (0)      221 2024-04-07 10:13:16.000000 OpsApi-1.0.1/OpsApi.egg-info/PKG-INFO
--rw-r--r--   0 root         (0) root         (0)      215 2024-04-07 10:13:16.000000 OpsApi-1.0.1/OpsApi.egg-info/SOURCES.txt
--rw-r--r--   0 root         (0) root         (0)       17 2024-04-07 10:13:16.000000 OpsApi-1.0.1/OpsApi.egg-info/requires.txt
--rw-r--r--   0 root         (0) root         (0)        7 2024-04-07 10:13:16.000000 OpsApi-1.0.1/OpsApi.egg-info/top_level.txt
--rw-r--r--   0 root         (0) root         (0)        1 2024-04-07 10:13:16.000000 OpsApi-1.0.1/OpsApi.egg-info/dependency_links.txt

+  [0x00000cb8]  Special opcode 145: advance Address by 10 to 0x57ca and Line by 0 to 2345
+  [0x00000cb9]  Advance Line by 969 to 3314
+  [0x00000cbc]  Special opcode 201: advance Address by 14 to 0x57d8 and Line by 0 to 3314
+  [0x00000cbd]  Special opcode 160: advance Address by 11 to 0x57e3 and Line by 1 to 3315
+  [0x00000cbe]  Special opcode 137: advance Address by 9 to 0x57ec and Line by 6 to 3321
+  [0x00000cbf]  Advance PC by constant 17 to 0x57fd
+  [0x00000cc0]  Special opcode 204: advance Address by 14 to 0x580b and Line by 3 to 3324
+  [0x00000cc1]  Special opcode 188: advance Address by 13 to 0x5818 and Line by 1 to 3325
+  [0x00000cc2]  Advance PC by constant 17 to 0x5829
+  [0x00000cc3]  Special opcode 230: advance Address by 16 to 0x5839 and Line by 1 to 3326
+  [0x00000cc4]  Advance Line by -979 to 2347
+  [0x00000cc7]  Special opcode 117: advance Address by 8 to 0x5841 and Line by 0 to 2347
+  [0x00000cc8]  Advance Line by 11 to 2358
+  [0x00000cca]  Special opcode 187: advance Address by 13 to 0x584e and Line by 0 to 2358
+  [0x00000ccb]  Advance Line by -29 to 2329
+  [0x00000ccd]  Special opcode 159: advance Address by 11 to 0x5859 and Line by 0 to 2329
+  [0x00000cce]  Advance Line by 996 to 3325
+  [0x00000cd1]  Special opcode 215: advance Address by 15 to 0x5868 and Line by 0 to 3325
+  [0x00000cd2]  Advance PC by constant 17 to 0x5879
+  [0x00000cd3]  Special opcode 62: advance Address by 4 to 0x587d and Line by 1 to 3326
+  [0x00000cd4]  Advance Line by -964 to 2362
+  [0x00000cd7]  Special opcode 145: advance Address by 10 to 0x5887 and Line by 0 to 2362
+  [0x00000cd8]  Advance PC by constant 17 to 0x5898
+  [0x00000cd9]  Special opcode 174: advance Address by 12 to 0x58a4 and Line by 1 to 2363
+  [0x00000cda]  Advance Line by 958 to 3321
+  [0x00000cdd]  Special opcode 61: advance Address by 4 to 0x58a8 and Line by 0 to 3321
+  [0x00000cde]  Advance PC by constant 17 to 0x58b9
+  [0x00000cdf]  Special opcode 70: advance Address by 5 to 0x58be and Line by -5 to 3316
+  [0x00000ce0]  Advance Line by -971 to 2345
+  [0x00000ce3]  Special opcode 187: advance Address by 13 to 0x58cb and Line by 0 to 2345
+  [0x00000ce4]  Advance Line by 971 to 3316
+  [0x00000ce7]  Special opcode 47: advance Address by 3 to 0x58ce and Line by 0 to 3316
+  [0x00000ce8]  Advance Line by -971 to 2345
+  [0x00000ceb]  Special opcode 47: advance Address by 3 to 0x58d1 and Line by 0 to 2345
+  [0x00000cec]  Advance Line by 982 to 3327
+  [0x00000cef]  Special opcode 117: advance Address by 8 to 0x58d9 and Line by 0 to 3327
+  [0x00000cf0]  Advance PC by 24 to 0x58f1
+  [0x00000cf2]  Extended opcode 1: End of Sequence
```

#### readelf --wide --debug-dump=info {}

```diff
@@ -1,20 +1,20 @@
 Contents of the .debug_info section:
 
   Compilation Unit @ offset 0:
-   Length:        0x7f6f (32-bit)
+   Length:        0x7f4e (32-bit)
    Version:       4
    Abbrev Offset: 0
    Pointer Size:  8
  <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
-    <c>   DW_AT_producer    : (strp) (offset: 0x2a4a): GNU C 4.8.5 20150623 (Red Hat 4.8.5-44) -g -O2 -fexceptions -fstack-protector-strong -fwrapv -fPIC --param ssp-buffer-size=4
+    <c>   DW_AT_producer    : (strp) (offset: 0x28ba): GNU C 4.8.5 20150623 (Red Hat 4.8.5-44) -m64 -mtune=generic -march=x86-64 -g -O2 -fexceptions -fstack-protector-strong -fwrapv -fPIC --param ssp-buffer-size=4
     <10>   DW_AT_language    : (data1) 1	(ANSI C)
     <11>   DW_AT_name        : (strp) (offset: 0x1e8e): OpsApi/models.c
     <15>   DW_AT_comp_dir    : (strp) (offset: 0x16e6): /data/py-test
-    <19>   DW_AT_ranges      : (sec_offset) 0x14b0
+    <19>   DW_AT_ranges      : (sec_offset) 0x1410
     <1d>   DW_AT_low_pc      : (addr) 0
     <25>   DW_AT_stmt_list   : (sec_offset) 0
  <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
     <2a>   DW_AT_name        : (strp) (offset: 0x1239): size_t
     <2e>   DW_AT_decl_file   : (data1) 2
     <2f>   DW_AT_decl_line   : (data1) 212
     <30>   DW_AT_type        : (ref4) <0x34>, long unsigned int
@@ -37,15 +37,15 @@
  <1><50>: Abbrev Number: 3 (DW_TAG_base_type)
     <51>   DW_AT_byte_size   : (data1) 1
     <52>   DW_AT_encoding    : (data1) 6	(signed char)
     <53>   DW_AT_name        : (strp) (offset: 0xa38): signed char
  <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
     <58>   DW_AT_byte_size   : (data1) 2
     <59>   DW_AT_encoding    : (data1) 5	(signed)
-    <5a>   DW_AT_name        : (strp) (offset: 0x29ba): short int
+    <5a>   DW_AT_name        : (strp) (offset: 0x2a59): short int
  <1><5e>: Abbrev Number: 4 (DW_TAG_base_type)
     <5f>   DW_AT_byte_size   : (data1) 4
     <60>   DW_AT_encoding    : (data1) 5	(signed)
     <61>   DW_AT_name        : (string) int
  <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
     <66>   DW_AT_byte_size   : (data1) 8
     <67>   DW_AT_encoding    : (data1) 5	(signed)
@@ -72,15 +72,15 @@
     <91>   DW_AT_decl_line   : (data1) 181
     <92>   DW_AT_type        : (ref4) <0x65>, long int
  <1><96>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <97>   DW_AT_byte_size   : (data1) 8
     <98>   DW_AT_type        : (ref4) <0x9c>, char
  <1><9c>: Abbrev Number: 3 (DW_TAG_base_type)
     <9d>   DW_AT_byte_size   : (data1) 1
-    <9e>   DW_AT_encoding    : (data1) 8	(unsigned char)
+    <9e>   DW_AT_encoding    : (data1) 6	(signed char)
     <9f>   DW_AT_name        : (strp) (offset: 0xa3f): char
  <1><a3>: Abbrev Number: 2 (DW_TAG_typedef)
     <a4>   DW_AT_name        : (strp) (offset: 0x1d6f): FILE
     <a8>   DW_AT_decl_file   : (data1) 4
     <a9>   DW_AT_decl_line   : (data1) 48
     <aa>   DW_AT_type        : (ref4) <0xae>, _IO_FILE
  <1><ae>: Abbrev Number: 7 (DW_TAG_structure_type)
@@ -194,15 +194,15 @@
  <2><192>: Abbrev Number: 9 (DW_TAG_member)
     <193>   DW_AT_name        : (strp) (offset: 0x2342): _cur_column
     <197>   DW_AT_decl_file   : (data1) 5
     <198>   DW_AT_decl_line   : (data2) 279
     <19a>   DW_AT_type        : (ref4) <0x42>, short unsigned int
     <19e>   DW_AT_data_member_location: (data1) 128
  <2><19f>: Abbrev Number: 9 (DW_TAG_member)
-    <1a0>   DW_AT_name        : (strp) (offset: 0x29ce): _vtable_offset
+    <1a0>   DW_AT_name        : (strp) (offset: 0x2a6d): _vtable_offset
     <1a4>   DW_AT_decl_file   : (data1) 5
     <1a5>   DW_AT_decl_line   : (data2) 280
     <1a7>   DW_AT_type        : (ref4) <0x50>, signed char
     <1ab>   DW_AT_data_member_location: (data1) 130
  <2><1ac>: Abbrev Number: 9 (DW_TAG_member)
     <1ad>   DW_AT_name        : (strp) (offset: 0x249): _shortbuf
     <1b1>   DW_AT_decl_file   : (data1) 5
@@ -326,30 +326,30 @@
     <2a9>   DW_AT_decl_file   : (data1) 4
     <2aa>   DW_AT_decl_line   : (data1) 102
     <2ab>   DW_AT_type        : (ref4) <0x8b>, __ssize_t, long int
  <1><2af>: Abbrev Number: 14 (DW_TAG_typedef)
     <2b0>   DW_AT_name        : (strp) (offset: 0x16fe): wchar_t
     <2b4>   DW_AT_decl_file   : (data1) 2
     <2b5>   DW_AT_decl_line   : (data2) 324
-    <2b7>   DW_AT_type        : (ref4) <0x49>, unsigned int
+    <2b7>   DW_AT_type        : (ref4) <0x5e>, int
  <1><2bb>: Abbrev Number: 3 (DW_TAG_base_type)
     <2bc>   DW_AT_byte_size   : (data1) 8
     <2bd>   DW_AT_encoding    : (data1) 5	(signed)
     <2be>   DW_AT_name        : (strp) (offset: 0x2696): long long int
- <1><2c2>: Abbrev Number: 11 (DW_TAG_array_type)
-    <2c3>   DW_AT_type        : (ref4) <0x9c>, char
-    <2c7>   DW_AT_sibling     : (ref4) <0x2d2>
- <2><2cb>: Abbrev Number: 12 (DW_TAG_subrange_type)
-    <2cc>   DW_AT_type        : (ref4) <0x82>, sizetype
-    <2d0>   DW_AT_upper_bound : (data1) 7
- <2><2d1>: Abbrev Number: 0
- <1><2d2>: Abbrev Number: 3 (DW_TAG_base_type)
-    <2d3>   DW_AT_byte_size   : (data1) 8
-    <2d4>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <2d5>   DW_AT_name        : (strp) (offset: 0x231b): long long unsigned int
+ <1><2c2>: Abbrev Number: 3 (DW_TAG_base_type)
+    <2c3>   DW_AT_byte_size   : (data1) 8
+    <2c4>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <2c5>   DW_AT_name        : (strp) (offset: 0x231b): long long unsigned int
+ <1><2c9>: Abbrev Number: 11 (DW_TAG_array_type)
+    <2ca>   DW_AT_type        : (ref4) <0x9c>, char
+    <2ce>   DW_AT_sibling     : (ref4) <0x2d9>
+ <2><2d2>: Abbrev Number: 12 (DW_TAG_subrange_type)
+    <2d3>   DW_AT_type        : (ref4) <0x82>, sizetype
+    <2d7>   DW_AT_upper_bound : (data1) 7
+ <2><2d8>: Abbrev Number: 0
  <1><2d9>: Abbrev Number: 11 (DW_TAG_array_type)
     <2da>   DW_AT_type        : (ref4) <0x9c>, char
     <2de>   DW_AT_sibling     : (ref4) <0x2e9>
  <2><2e2>: Abbrev Number: 12 (DW_TAG_subrange_type)
     <2e3>   DW_AT_type        : (ref4) <0x82>, sizetype
     <2e7>   DW_AT_upper_bound : (data1) 13
  <2><2e8>: Abbrev Number: 0
@@ -422,15 +422,15 @@
  <2><373>: Abbrev Number: 9 (DW_TAG_member)
     <374>   DW_AT_name        : (strp) (offset: 0x1514): tp_name
     <378>   DW_AT_decl_file   : (data1) 8
     <379>   DW_AT_decl_line   : (data2) 348
     <37b>   DW_AT_type        : (ref4) <0x299>, char
     <37f>   DW_AT_data_member_location: (data1) 24
  <2><380>: Abbrev Number: 9 (DW_TAG_member)
-    <381>   DW_AT_name        : (strp) (offset: 0x2a07): tp_basicsize
+    <381>   DW_AT_name        : (strp) (offset: 0x2aa6): tp_basicsize
     <385>   DW_AT_decl_file   : (data1) 8
     <386>   DW_AT_decl_line   : (data2) 349
     <388>   DW_AT_type        : (ref4) <0x30f>, Py_ssize_t, ssize_t, __ssize_t, long int
     <38c>   DW_AT_data_member_location: (data1) 32
  <2><38d>: Abbrev Number: 9 (DW_TAG_member)
     <38e>   DW_AT_name        : (strp) (offset: 0x347): tp_itemsize
     <392>   DW_AT_decl_file   : (data1) 8
@@ -608,15 +608,15 @@
  <2><508>: Abbrev Number: 16 (DW_TAG_member)
     <509>   DW_AT_name        : (strp) (offset: 0x21b1): tp_descr_get
     <50d>   DW_AT_decl_file   : (data1) 8
     <50e>   DW_AT_decl_line   : (data2) 407
     <510>   DW_AT_type        : (ref4) <0xd24>, descrgetfunc, PyObject, _object
     <514>   DW_AT_data_member_location: (data2) 272
  <2><516>: Abbrev Number: 16 (DW_TAG_member)
-    <517>   DW_AT_name        : (strp) (offset: 0x294b): tp_descr_set
+    <517>   DW_AT_name        : (strp) (offset: 0x29ea): tp_descr_set
     <51b>   DW_AT_decl_file   : (data1) 8
     <51c>   DW_AT_decl_line   : (data2) 408
     <51e>   DW_AT_type        : (ref4) <0xd30>, descrsetfunc, int
     <522>   DW_AT_data_member_location: (data2) 280
  <2><524>: Abbrev Number: 16 (DW_TAG_member)
     <525>   DW_AT_name        : (strp) (offset: 0xaab): tp_dictoffset
     <529>   DW_AT_decl_file   : (data1) 8
@@ -945,15 +945,15 @@
     <7df>   DW_AT_type        : (ref4) <0x89>
     <7e3>   DW_AT_data_member_location: (data1) 72
  <2><7e4>: Abbrev Number: 0
  <1><7e5>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <7e6>   DW_AT_byte_size   : (data1) 8
     <7e7>   DW_AT_type        : (ref4) <0x30f>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><7eb>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7ec>   DW_AT_name        : (strp) (offset: 0x297b): Py_buffer
+    <7ec>   DW_AT_name        : (strp) (offset: 0x2a1a): Py_buffer
     <7f0>   DW_AT_decl_file   : (data1) 8
     <7f1>   DW_AT_decl_line   : (data1) 195
     <7f2>   DW_AT_type        : (ref4) <0x754>, bufferinfo
  <1><7f6>: Abbrev Number: 2 (DW_TAG_typedef)
     <7f7>   DW_AT_name        : (strp) (offset: 0x1ed1): getbufferproc
     <7fb>   DW_AT_decl_file   : (data1) 8
     <7fc>   DW_AT_decl_line   : (data1) 197
@@ -988,15 +988,15 @@
     <838>   DW_AT_sibling     : (ref4) <0x847>
  <2><83c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <83d>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <2><841>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     <842>   DW_AT_type        : (ref4) <0x820>, Py_buffer, bufferinfo
  <2><846>: Abbrev Number: 0
  <1><847>: Abbrev Number: 2 (DW_TAG_typedef)
-    <848>   DW_AT_name        : (strp) (offset: 0x2afe): objobjproc
+    <848>   DW_AT_name        : (strp) (offset: 0x2b20): objobjproc
     <84c>   DW_AT_decl_file   : (data1) 8
     <84d>   DW_AT_decl_line   : (data1) 235
     <84e>   DW_AT_type        : (ref4) <0x852>, int
  <1><852>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <853>   DW_AT_byte_size   : (data1) 8
     <854>   DW_AT_type        : (ref4) <0x858>, int
  <1><858>: Abbrev Number: 18 (DW_TAG_subroutine_type)
@@ -1070,15 +1070,15 @@
  <2><8e8>: Abbrev Number: 8 (DW_TAG_member)
     <8e9>   DW_AT_name        : (strp) (offset: 0x62b): nb_remainder
     <8ed>   DW_AT_decl_file   : (data1) 8
     <8ee>   DW_AT_decl_line   : (data1) 248
     <8ef>   DW_AT_type        : (ref4) <0x64c>, binaryfunc, PyObject, _object
     <8f3>   DW_AT_data_member_location: (data1) 24
  <2><8f4>: Abbrev Number: 8 (DW_TAG_member)
-    <8f5>   DW_AT_name        : (strp) (offset: 0x2af4): nb_divmod
+    <8f5>   DW_AT_name        : (strp) (offset: 0x2b16): nb_divmod
     <8f9>   DW_AT_decl_file   : (data1) 8
     <8fa>   DW_AT_decl_line   : (data1) 249
     <8fb>   DW_AT_type        : (ref4) <0x64c>, binaryfunc, PyObject, _object
     <8ff>   DW_AT_data_member_location: (data1) 32
  <2><900>: Abbrev Number: 8 (DW_TAG_member)
     <901>   DW_AT_name        : (strp) (offset: 0x253): nb_power
     <905>   DW_AT_decl_file   : (data1) 8
@@ -1142,15 +1142,15 @@
  <2><97c>: Abbrev Number: 9 (DW_TAG_member)
     <97d>   DW_AT_name        : (strp) (offset: 0x191a): nb_or
     <981>   DW_AT_decl_file   : (data1) 8
     <982>   DW_AT_decl_line   : (data2) 260
     <984>   DW_AT_type        : (ref4) <0x64c>, binaryfunc, PyObject, _object
     <988>   DW_AT_data_member_location: (data1) 120
  <2><989>: Abbrev Number: 9 (DW_TAG_member)
-    <98a>   DW_AT_name        : (strp) (offset: 0x2944): nb_int
+    <98a>   DW_AT_name        : (strp) (offset: 0x29e3): nb_int
     <98e>   DW_AT_decl_file   : (data1) 8
     <98f>   DW_AT_decl_line   : (data2) 261
     <991>   DW_AT_type        : (ref4) <0x62c>, unaryfunc, PyObject, _object
     <995>   DW_AT_data_member_location: (data1) 128
  <2><996>: Abbrev Number: 9 (DW_TAG_member)
     <997>   DW_AT_name        : (strp) (offset: 0xeda): nb_reserved
     <99b>   DW_AT_decl_file   : (data1) 8
@@ -1166,15 +1166,15 @@
  <2><9b0>: Abbrev Number: 9 (DW_TAG_member)
     <9b1>   DW_AT_name        : (strp) (offset: 0xeb5): nb_inplace_add
     <9b5>   DW_AT_decl_file   : (data1) 8
     <9b6>   DW_AT_decl_line   : (data2) 265
     <9b8>   DW_AT_type        : (ref4) <0x64c>, binaryfunc, PyObject, _object
     <9bc>   DW_AT_data_member_location: (data1) 152
  <2><9bd>: Abbrev Number: 9 (DW_TAG_member)
-    <9be>   DW_AT_name        : (strp) (offset: 0x2a14): nb_inplace_subtract
+    <9be>   DW_AT_name        : (strp) (offset: 0x2ab3): nb_inplace_subtract
     <9c2>   DW_AT_decl_file   : (data1) 8
     <9c3>   DW_AT_decl_line   : (data2) 266
     <9c5>   DW_AT_type        : (ref4) <0x64c>, binaryfunc, PyObject, _object
     <9c9>   DW_AT_data_member_location: (data1) 160
  <2><9ca>: Abbrev Number: 9 (DW_TAG_member)
     <9cb>   DW_AT_name        : (strp) (offset: 0x680): nb_inplace_multiply
     <9cf>   DW_AT_decl_file   : (data1) 8
@@ -1256,15 +1256,15 @@
  <2><a75>: Abbrev Number: 16 (DW_TAG_member)
     <a76>   DW_AT_name        : (strp) (offset: 0x1e7): nb_matrix_multiply
     <a7a>   DW_AT_decl_file   : (data1) 8
     <a7b>   DW_AT_decl_line   : (data2) 283
     <a7d>   DW_AT_type        : (ref4) <0x64c>, binaryfunc, PyObject, _object
     <a81>   DW_AT_data_member_location: (data2) 272
  <2><a83>: Abbrev Number: 16 (DW_TAG_member)
-    <a84>   DW_AT_name        : (strp) (offset: 0x29ec): nb_inplace_matrix_multiply
+    <a84>   DW_AT_name        : (strp) (offset: 0x2a8b): nb_inplace_matrix_multiply
     <a88>   DW_AT_decl_file   : (data1) 8
     <a89>   DW_AT_decl_line   : (data2) 284
     <a8b>   DW_AT_type        : (ref4) <0x64c>, binaryfunc, PyObject, _object
     <a8f>   DW_AT_data_member_location: (data2) 280
  <2><a91>: Abbrev Number: 0
  <1><a92>: Abbrev Number: 14 (DW_TAG_typedef)
     <a93>   DW_AT_name        : (strp) (offset: 0xacb): PyNumberMethods
@@ -1560,15 +1560,15 @@
  <2><d0b>: Abbrev Number: 0
  <1><d0c>: Abbrev Number: 14 (DW_TAG_typedef)
     <d0d>   DW_AT_name        : (strp) (offset: 0xdd8): getiterfunc
     <d11>   DW_AT_decl_file   : (data1) 8
     <d12>   DW_AT_decl_line   : (data2) 335
     <d14>   DW_AT_type        : (ref4) <0x637>, PyObject, _object
  <1><d18>: Abbrev Number: 14 (DW_TAG_typedef)
-    <d19>   DW_AT_name        : (strp) (offset: 0x2922): iternextfunc
+    <d19>   DW_AT_name        : (strp) (offset: 0x29c1): iternextfunc
     <d1d>   DW_AT_decl_file   : (data1) 8
     <d1e>   DW_AT_decl_line   : (data2) 336
     <d20>   DW_AT_type        : (ref4) <0x637>, PyObject, _object
  <1><d24>: Abbrev Number: 14 (DW_TAG_typedef)
     <d25>   DW_AT_name        : (strp) (offset: 0xe81): descrgetfunc
     <d29>   DW_AT_decl_file   : (data1) 8
     <d2a>   DW_AT_decl_line   : (data2) 337
@@ -1836,20 +1836,20 @@
     <f38>   DW_AT_decl_line   : (data2) 333
     <f3a>   DW_AT_type        : (ref4) <0xea9>
     <f3e>   DW_AT_data_member_location: (data1) 32
  <2><f3f>: Abbrev Number: 9 (DW_TAG_member)
     <f40>   DW_AT_name        : (strp) (offset: 0x5c4): wstr
     <f44>   DW_AT_decl_file   : (data1) 12
     <f45>   DW_AT_decl_line   : (data2) 334
-    <f47>   DW_AT_type        : (ref4) <0xf4d>, wchar_t, unsigned int
+    <f47>   DW_AT_type        : (ref4) <0xf4d>, wchar_t, int
     <f4b>   DW_AT_data_member_location: (data1) 40
  <2><f4c>: Abbrev Number: 0
  <1><f4d>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <f4e>   DW_AT_byte_size   : (data1) 8
-    <f4f>   DW_AT_type        : (ref4) <0x2af>, wchar_t, unsigned int
+    <f4f>   DW_AT_type        : (ref4) <0x2af>, wchar_t, int
  <1><f53>: Abbrev Number: 14 (DW_TAG_typedef)
     <f54>   DW_AT_name        : (strp) (offset: 0x22bd): PyASCIIObject
     <f58>   DW_AT_decl_file   : (data1) 12
     <f59>   DW_AT_decl_line   : (data2) 335
     <f5b>   DW_AT_type        : (ref4) <0xf03>
  <1><f5f>: Abbrev Number: 7 (DW_TAG_structure_type)
     <f60>   DW_AT_name        : (strp) (offset: 0x1240): _longobject
@@ -2044,15 +2044,15 @@
     <10da>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <10de>   DW_AT_data_member_location: (data1) 40
  <2><10df>: Abbrev Number: 0
  <1><10e0>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <10e1>   DW_AT_byte_size   : (data1) 8
     <10e2>   DW_AT_type        : (ref4) <0x1090>, PyMethodDef, PyMethodDef
  <1><10e6>: Abbrev Number: 2 (DW_TAG_typedef)
-    <10e7>   DW_AT_name        : (strp) (offset: 0x28d6): PyCFunctionObject
+    <10e7>   DW_AT_name        : (strp) (offset: 0x2975): PyCFunctionObject
     <10eb>   DW_AT_decl_file   : (data1) 9
     <10ec>   DW_AT_decl_line   : (data1) 97
     <10ed>   DW_AT_type        : (ref4) <0x109b>
  <1><10f1>: Abbrev Number: 7 (DW_TAG_structure_type)
     <10f2>   DW_AT_name        : (strp) (offset: 0xba9): PyModuleDef_Base
     <10f6>   DW_AT_byte_size   : (data1) 40
     <10f7>   DW_AT_decl_file   : (data1) 17
@@ -2225,15 +2225,15 @@
  <2><1242>: Abbrev Number: 8 (DW_TAG_member)
     <1243>   DW_AT_name        : (strp) (offset: 0x1abb): func_closure
     <1247>   DW_AT_decl_file   : (data1) 18
     <1248>   DW_AT_decl_line   : (data1) 27
     <1249>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <124d>   DW_AT_data_member_location: (data1) 48
  <2><124e>: Abbrev Number: 8 (DW_TAG_member)
-    <124f>   DW_AT_name        : (strp) (offset: 0x29b1): func_doc
+    <124f>   DW_AT_name        : (strp) (offset: 0x2a50): func_doc
     <1253>   DW_AT_decl_file   : (data1) 18
     <1254>   DW_AT_decl_line   : (data1) 28
     <1255>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <1259>   DW_AT_data_member_location: (data1) 56
  <2><125a>: Abbrev Number: 8 (DW_TAG_member)
     <125b>   DW_AT_name        : (strp) (offset: 0x1e84): func_name
     <125f>   DW_AT_decl_file   : (data1) 18
@@ -2515,15 +2515,15 @@
  <2><1488>: Abbrev Number: 8 (DW_TAG_member)
     <1489>   DW_AT_name        : (strp) (offset: 0x22cb): codec_error_registry
     <148d>   DW_AT_decl_file   : (data1) 20
     <148e>   DW_AT_decl_line   : (data1) 39
     <148f>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <1493>   DW_AT_data_member_location: (data1) 72
  <2><1494>: Abbrev Number: 8 (DW_TAG_member)
-    <1495>   DW_AT_name        : (strp) (offset: 0x290f): codecs_initialized
+    <1495>   DW_AT_name        : (strp) (offset: 0x29ae): codecs_initialized
     <1499>   DW_AT_decl_file   : (data1) 20
     <149a>   DW_AT_decl_line   : (data1) 40
     <149b>   DW_AT_type        : (ref4) <0x5e>, int
     <149f>   DW_AT_data_member_location: (data1) 80
  <2><14a0>: Abbrev Number: 8 (DW_TAG_member)
     <14a1>   DW_AT_name        : (strp) (offset: 0x2f): fscodec_initialized
     <14a5>   DW_AT_decl_file   : (data1) 20
@@ -2561,15 +2561,15 @@
  <1><14e3>: Abbrev Number: 30 (DW_TAG_structure_type)
     <14e4>   DW_AT_name        : (string) _ts
     <14e8>   DW_AT_byte_size   : (data2) 2272
     <14ea>   DW_AT_decl_file   : (data1) 20
     <14eb>   DW_AT_decl_line   : (data1) 84
     <14ec>   DW_AT_sibling     : (ref4) <0x167f>
  <2><14f0>: Abbrev Number: 8 (DW_TAG_member)
-    <14f1>   DW_AT_name        : (strp) (offset: 0x29c9): prev
+    <14f1>   DW_AT_name        : (strp) (offset: 0x2a68): prev
     <14f5>   DW_AT_decl_file   : (data1) 20
     <14f6>   DW_AT_decl_line   : (data1) 87
     <14f7>   DW_AT_type        : (ref4) <0x167f>, _ts
     <14fb>   DW_AT_data_member_location: (data1) 0
  <2><14fc>: Abbrev Number: 8 (DW_TAG_member)
     <14fd>   DW_AT_name        : (strp) (offset: 0x1121): next
     <1501>   DW_AT_decl_file   : (data1) 20
@@ -2763,15 +2763,15 @@
     <1678>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <167c>   DW_AT_data_member_location: (data2) 2264
  <2><167e>: Abbrev Number: 0
  <1><167f>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <1680>   DW_AT_byte_size   : (data1) 8
     <1681>   DW_AT_type        : (ref4) <0x14e3>, _ts
  <1><1685>: Abbrev Number: 2 (DW_TAG_typedef)
-    <1686>   DW_AT_name        : (strp) (offset: 0x2b1d): PyInterpreterState
+    <1686>   DW_AT_name        : (strp) (offset: 0x2b3f): PyInterpreterState
     <168a>   DW_AT_decl_file   : (data1) 20
     <168b>   DW_AT_decl_line   : (data1) 51
     <168c>   DW_AT_type        : (ref4) <0x1410>, _is
  <1><1690>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <1691>   DW_AT_byte_size   : (data1) 8
     <1692>   DW_AT_type        : (ref4) <0x1685>, PyInterpreterState, _is
  <1><1696>: Abbrev Number: 11 (DW_TAG_array_type)
@@ -2859,15 +2859,15 @@
  <2><1748>: Abbrev Number: 8 (DW_TAG_member)
     <1749>   DW_AT_name        : (strp) (offset: 0x892): ob_base
     <174d>   DW_AT_decl_file   : (data1) 11
     <174e>   DW_AT_decl_line   : (data1) 42
     <174f>   DW_AT_type        : (ref4) <0x5ef>, PyObject, _object
     <1753>   DW_AT_data_member_location: (data1) 0
  <2><1754>: Abbrev Number: 8 (DW_TAG_member)
-    <1755>   DW_AT_name        : (strp) (offset: 0x28bf): d_type
+    <1755>   DW_AT_name        : (strp) (offset: 0x295e): d_type
     <1759>   DW_AT_decl_file   : (data1) 11
     <175a>   DW_AT_decl_line   : (data1) 43
     <175b>   DW_AT_type        : (ref4) <0x1779>, PyTypeObject, _typeobject
     <175f>   DW_AT_data_member_location: (data1) 16
  <2><1760>: Abbrev Number: 8 (DW_TAG_member)
     <1761>   DW_AT_name        : (strp) (offset: 0xc66): d_name
     <1765>   DW_AT_decl_file   : (data1) 11
@@ -2897,15 +2897,15 @@
  <2><1792>: Abbrev Number: 8 (DW_TAG_member)
     <1793>   DW_AT_name        : (strp) (offset: 0x18f2): d_common
     <1797>   DW_AT_decl_file   : (data1) 11
     <1798>   DW_AT_decl_line   : (data1) 54
     <1799>   DW_AT_type        : (ref4) <0x177f>, PyDescrObject
     <179d>   DW_AT_data_member_location: (data1) 0
  <2><179e>: Abbrev Number: 8 (DW_TAG_member)
-    <179f>   DW_AT_name        : (strp) (offset: 0x293b): d_method
+    <179f>   DW_AT_name        : (strp) (offset: 0x29da): d_method
     <17a3>   DW_AT_decl_file   : (data1) 11
     <17a4>   DW_AT_decl_line   : (data1) 55
     <17a5>   DW_AT_type        : (ref4) <0x10e0>, PyMethodDef, PyMethodDef
     <17a9>   DW_AT_data_member_location: (data1) 40
  <2><17aa>: Abbrev Number: 0
  <1><17ab>: Abbrev Number: 2 (DW_TAG_typedef)
     <17ac>   DW_AT_name        : (strp) (offset: 0x286b): PyMethodDescrObject
@@ -2988,15 +2988,15 @@
  <2><1847>: Abbrev Number: 8 (DW_TAG_member)
     <1848>   DW_AT_name        : (strp) (offset: 0xc04): co_freevars
     <184c>   DW_AT_decl_file   : (data1) 22
     <184d>   DW_AT_decl_line   : (data1) 33
     <184e>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <1852>   DW_AT_data_member_location: (data1) 72
  <2><1853>: Abbrev Number: 8 (DW_TAG_member)
-    <1854>   DW_AT_name        : (strp) (offset: 0x2ac7): co_cellvars
+    <1854>   DW_AT_name        : (strp) (offset: 0x2ae9): co_cellvars
     <1858>   DW_AT_decl_file   : (data1) 22
     <1859>   DW_AT_decl_line   : (data1) 34
     <185a>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <185e>   DW_AT_data_member_location: (data1) 80
  <2><185f>: Abbrev Number: 8 (DW_TAG_member)
     <1860>   DW_AT_name        : (strp) (offset: 0x7b8): co_cell2arg
     <1864>   DW_AT_decl_file   : (data1) 22
@@ -3085,15 +3085,15 @@
  <2><1907>: Abbrev Number: 9 (DW_TAG_member)
     <1908>   DW_AT_name        : (strp) (offset: 0x3b2): is_unicode
     <190c>   DW_AT_decl_file   : (data1) 1
     <190d>   DW_AT_decl_line   : (data2) 1243
     <190f>   DW_AT_type        : (ref4) <0x29f>, char
     <1913>   DW_AT_data_member_location: (data1) 32
  <2><1914>: Abbrev Number: 9 (DW_TAG_member)
-    <1915>   DW_AT_name        : (strp) (offset: 0x2aed): is_str
+    <1915>   DW_AT_name        : (strp) (offset: 0x2b0f): is_str
     <1919>   DW_AT_decl_file   : (data1) 1
     <191a>   DW_AT_decl_line   : (data2) 1243
     <191c>   DW_AT_type        : (ref4) <0x29f>, char
     <1920>   DW_AT_data_member_location: (data1) 33
  <2><1921>: Abbrev Number: 9 (DW_TAG_member)
     <1922>   DW_AT_name        : (strp) (offset: 0x6e8): intern
     <1926>   DW_AT_decl_file   : (data1) 1
@@ -3139,15 +3139,15 @@
  <2><197b>: Abbrev Number: 9 (DW_TAG_member)
     <197c>   DW_AT_name        : (strp) (offset: 0x192a): func_qualname
     <1980>   DW_AT_decl_file   : (data1) 1
     <1981>   DW_AT_decl_line   : (data2) 1804
     <1983>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <1987>   DW_AT_data_member_location: (data1) 64
  <2><1988>: Abbrev Number: 9 (DW_TAG_member)
-    <1989>   DW_AT_name        : (strp) (offset: 0x29b1): func_doc
+    <1989>   DW_AT_name        : (strp) (offset: 0x2a50): func_doc
     <198d>   DW_AT_decl_file   : (data1) 1
     <198e>   DW_AT_decl_line   : (data2) 1805
     <1990>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <1994>   DW_AT_data_member_location: (data1) 72
  <2><1995>: Abbrev Number: 9 (DW_TAG_member)
     <1996>   DW_AT_name        : (strp) (offset: 0xb67): func_globals
     <199a>   DW_AT_decl_file   : (data1) 1
@@ -3377,15 +3377,15 @@
  <2><1b74>: Abbrev Number: 9 (DW_TAG_member)
     <1b75>   DW_AT_name        : (strp) (offset: 0x2379): __pyx_kp_s_Hello_World
     <1b79>   DW_AT_decl_file   : (data1) 1
     <1b7a>   DW_AT_decl_line   : (data2) 2113
     <1b7c>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <1b80>   DW_AT_data_member_location: (data1) 56
  <2><1b81>: Abbrev Number: 9 (DW_TAG_member)
-    <1b82>   DW_AT_name        : (strp) (offset: 0x2a28): __pyx_n_s_Message
+    <1b82>   DW_AT_name        : (strp) (offset: 0x2ac7): __pyx_n_s_Message
     <1b86>   DW_AT_decl_file   : (data1) 1
     <1b87>   DW_AT_decl_line   : (data2) 2114
     <1b89>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
     <1b8d>   DW_AT_data_member_location: (data1) 64
  <2><1b8e>: Abbrev Number: 9 (DW_TAG_member)
     <1b8f>   DW_AT_name        : (strp) (offset: 0x2b5): __pyx_n_s_Message_test
     <1b93>   DW_AT_decl_file   : (data1) 1
@@ -3713,15 +3713,15 @@
  <4><1e52>: Abbrev Number: 38 (DW_TAG_variable)
     <1e53>   DW_AT_name        : (strp) (offset: 0x1903): _py_xdecref_tmp
     <1e57>   DW_AT_decl_file   : (data1) 1
     <1e58>   DW_AT_decl_line   : (data2) 3883
     <1e5a>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <4><1e5e>: Abbrev Number: 39 (DW_TAG_lexical_block)
  <5><1e5f>: Abbrev Number: 38 (DW_TAG_variable)
-    <1e60>   DW_AT_name        : (strp) (offset: 0x2900): _py_decref_tmp
+    <1e60>   DW_AT_name        : (strp) (offset: 0x299f): _py_decref_tmp
     <1e64>   DW_AT_decl_file   : (data1) 1
     <1e65>   DW_AT_decl_line   : (data2) 3883
     <1e67>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <5><1e6b>: Abbrev Number: 0
  <4><1e6c>: Abbrev Number: 0
  <3><1e6d>: Abbrev Number: 0
  <2><1e6e>: Abbrev Number: 0
@@ -3758,15 +3758,15 @@
  <4><1eb1>: Abbrev Number: 38 (DW_TAG_variable)
     <1eb2>   DW_AT_name        : (strp) (offset: 0x1903): _py_xdecref_tmp
     <1eb6>   DW_AT_decl_file   : (data1) 1
     <1eb7>   DW_AT_decl_line   : (data2) 3762
     <1eb9>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <4><1ebd>: Abbrev Number: 39 (DW_TAG_lexical_block)
  <5><1ebe>: Abbrev Number: 38 (DW_TAG_variable)
-    <1ebf>   DW_AT_name        : (strp) (offset: 0x2900): _py_decref_tmp
+    <1ebf>   DW_AT_name        : (strp) (offset: 0x299f): _py_decref_tmp
     <1ec3>   DW_AT_decl_file   : (data1) 1
     <1ec4>   DW_AT_decl_line   : (data2) 3762
     <1ec6>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <5><1eca>: Abbrev Number: 0
  <4><1ecb>: Abbrev Number: 0
  <3><1ecc>: Abbrev Number: 0
  <2><1ecd>: Abbrev Number: 0
@@ -3803,15 +3803,15 @@
  <4><1f10>: Abbrev Number: 38 (DW_TAG_variable)
     <1f11>   DW_AT_name        : (strp) (offset: 0x1903): _py_xdecref_tmp
     <1f15>   DW_AT_decl_file   : (data1) 1
     <1f16>   DW_AT_decl_line   : (data2) 3732
     <1f18>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <4><1f1c>: Abbrev Number: 39 (DW_TAG_lexical_block)
  <5><1f1d>: Abbrev Number: 38 (DW_TAG_variable)
-    <1f1e>   DW_AT_name        : (strp) (offset: 0x2900): _py_decref_tmp
+    <1f1e>   DW_AT_name        : (strp) (offset: 0x299f): _py_decref_tmp
     <1f22>   DW_AT_decl_file   : (data1) 1
     <1f23>   DW_AT_decl_line   : (data2) 3732
     <1f25>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <5><1f29>: Abbrev Number: 0
  <4><1f2a>: Abbrev Number: 0
  <3><1f2b>: Abbrev Number: 0
  <2><1f2c>: Abbrev Number: 0
@@ -3848,15 +3848,15 @@
  <4><1f6f>: Abbrev Number: 38 (DW_TAG_variable)
     <1f70>   DW_AT_name        : (strp) (offset: 0x1903): _py_xdecref_tmp
     <1f74>   DW_AT_decl_file   : (data1) 1
     <1f75>   DW_AT_decl_line   : (data2) 3707
     <1f77>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <4><1f7b>: Abbrev Number: 39 (DW_TAG_lexical_block)
  <5><1f7c>: Abbrev Number: 38 (DW_TAG_variable)
-    <1f7d>   DW_AT_name        : (strp) (offset: 0x2900): _py_decref_tmp
+    <1f7d>   DW_AT_name        : (strp) (offset: 0x299f): _py_decref_tmp
     <1f81>   DW_AT_decl_file   : (data1) 1
     <1f82>   DW_AT_decl_line   : (data2) 3707
     <1f84>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <5><1f88>: Abbrev Number: 0
  <4><1f89>: Abbrev Number: 0
  <3><1f8a>: Abbrev Number: 0
  <2><1f8b>: Abbrev Number: 0
@@ -4036,15 +4036,15 @@
  <4><20f4>: Abbrev Number: 38 (DW_TAG_variable)
     <20f5>   DW_AT_name        : (strp) (offset: 0x1903): _py_xdecref_tmp
     <20f9>   DW_AT_decl_file   : (data1) 1
     <20fa>   DW_AT_decl_line   : (data2) 3854
     <20fc>   DW_AT_type        : (ref4) <0x626>, PyObject, _object
  <4><2100>: Abbrev Number: 39 (DW_TAG_lexical_block)
  <5><2101>: Abbrev Number: 38 (DW_TAG_variable)
